{
  "responseHeader": {
    "status": 0,
    "QTime": 132
  },
  "response": {
    "numFound": 227,
    "start": 0,
    "numFoundExact": true,
    "docs": [
      {
        "story_id": 20447378,
        "story_author": "susam",
        "story_descendants": 65,
        "story_score": 150,
        "story_time": "2019-07-16T04:03:25Z",
        "story_title": "Lunar Eclipse: An Email to a Daughter and Son-in-Law",
        "search": [
          "Lunar Eclipse: An Email to a Daughter and Son-in-Law",
          "https://groups.google.com/d/msg/b-a-s/9rcz9MbC5p8/2Q8txQgGBAAJ",
          "Vasanth BRunread,Jul 15, 2019, 11:50:39 PM7/15/19to TS...@yahoogroups.com, subramanya cr, absb...@googlegroups.com, b-...@googlegroups.com, Shyamal Sarkar, ind...@googlegroups.com, Military...@yahoogroups.com, ma...@randhirmishra.com, s_chowdh...@yahoo.com, Swaga...@gmail.com, vas...@learningaccord.com AN EMAIL TO A DAUGHTER & SON-IN-LAW. Tue, 16 Jul 19 / 01:32 Dear Shirin & Arun, Place Flight M British Standard Time Indian Standard Time Duration Distance A/C Speed Alt London BA 119 D Tue, 16 Jul / 14:25 (+01:00) Tue, 16 Jul / 18:55 (+05:30) B 777 Bengaluru A Wed, 17 Jul / 00:05 (+01:00) Wed, 17 Jul / 04:35 (+05:30) 09:40 hr 8,010 km 869 km/h 11,280 mt On Wed, 17 Jul, a Partial Lunar Eclipse begins at (all IST) 01:31:43, reaches Maximum 65% at 03:00:44 and Ends at 04:29:39. You will be landing in Bengaluru, at 04:35; just 5 minutes after the Eclipse ends. Solar Eclipses are Virtual. They really do not exist. They are Localised OUR Views of the sun, from an individual on the earth. They are no different from holding an umbrella over your head, when walking under the sun. Instead of the umbrella, you are \"holding\"the moon over your head, blocking the sun, only to you, locally; only about 30 km around you. It is about 30 km radius circle, because your umbrella is about 1 mt diametre and the moon's diametre is 3,476 km; but then, it is 362,600 km to 405,600 km away. Lunar Eclipses are real. They are actually happening of an event on the moon. The earth's shadow, is actually falling on the moon. All the persons in half earth who can see the moon, can see the Eclipse, in the same manner. When you take off from London, set your watch 04 hr 30 mt head. In that watch, when it isIndia's time, 01:31:43 (correct to the second), the Eclipse begins. You can calibrate your watch, correct to the second. Please try to get a seat on the right side, so that you can get a view on the West side. Do not sit over the wing. When the Eclipse starts at 01:32, you will be over Oman (wave to Arun's sister Anita). From Oman to Bengaluru, you willfly due South-East. You do not have to crane your neck. See the moon at level, straight through your window. This is a rare opportunity, to see the entire Lunar Eclipse of 02 hr 57 mt 56 sc through the window of a plane. Take your BEST binoculars with you. If you do not have one, purchase it in Belfast or London. At 11.28 km high, above the atmosphere, your moon sight will be in crystal clear sky. As the Earth's sharply edged shadow races across the moon's surface, at about 1,000 km per hour, through your binoculars, you will see the edge of the shadow climbing up the moon's mountains and dipping below into the valleys. From the Earth's surface, the moon appears flat. In reality, the centre of the moon is 1,738 km nearer to you. From a plane, at 11 km above the Earth's surface, as the Earth's shadow's edge races across the moon's surface, your eyes will suddenly see the moon in 3 dimensions. Just intently stare at the moon. Your brain will suddenly pop up the moon into 3 dimensions. This is a million pounds worth ofexperience, which you can NEVER have fromthe Earth's surface. Looking forward to meeting you. DAD BHU1 LORDunread,Jul 16, 2019, 7:09:25 AM7/16/19to b-...@googlegroups.comNo offence but why is this on a public mailing list keerthi kiranunread,Jul 16, 2019, 7:38:52 AM7/16/19to BASHi Vasanth,Nice to see your mail after a long time :)It was a nice read... I wish I was on that flight :)I saw one error in your mail. The eclipse will happen in the eastern sky. So they should get a view on the \"East side of the plane\".Also, they can inform the crew so that the crew informs the other passengers. All the best to them. Hope they get to witness a wonderful eclipse (and may be take a photo from the cockpit).Thanks and Regards,Keerthi -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. keerthi kiranunread,Jul 16, 2019, 7:51:22 AM7/16/19to BASHi Bhu1 Lord,The mail (although written in a personal context) is informational. Also, it is a good read :)Regards,Keerthi -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. Message has been deletedSusam Palunread,Jul 16, 2019, 8:15:54 AM7/16/19to Bangalore Astronomical SocietyThe eclipse would begin at 01:32 AM IST, i.e., 00:02 AM GST at Oman when the plane is likely flying over Oman. In Muscat (Oman), the moon would rise at 06:39 PM GST in the East-southeast, cross the local meridian at 12:09 AM GST, and set at 05:40 AM GST in the West-southwest [1]. Therefore, when the eclipse would start at 00:02 AM GST, the moon would be in the eastern sky close to the local meridian at Muscat.But then most of the remaining eclipse seems to take place in the western sky. For example, in Bangalore, the moon would rise at 06:30 PM IST in the East-southeast, cross the local meridian at 12:20 AM IST, and set at 06:10 AM IST in the West-southwest [2]. Therefore, when the eclipse would end at 04:29 AM IST, the moon would be in the western sky ready to set in about 1.5 hours. It looks like most of the eclipse would indeed be visible in the western sky from this particular flight.[1]: https://www.timeanddate.com/moon/oman/muscat[2]: https://www.timeanddate.com/moon/india/bangaloreThanks,Susam -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group.Shashikiran Kolarunread,Jul 16, 2019, 2:50:55 PM7/16/19to Bangalore Astronomical SocietyYes, as Susam says, with respect to Muscat and India, the Moon spends most of its time in the Western half of the sky when it enters the Earth's umbral shadow.Muscat is 22, or about 90 minutes, West of Bangalore. So, if the partial eclipse begins at 1.30AM here, it would do so at 12.00AM at Muscat. Since this is the full moon, it's in opposition and hence transits to Western part of the sky at (local) 12.00AM. Also, the plane would be flying Eastwards, causing the Moon would always hang in the Western part of the sky thereon.That lunar eclipses always begin at the Eastern limb of the Moon was perhaps confused with the Moon being in the Eastern half of the sky?As an aside, it is likely that certain depictions on temples indicate eclipses. In the attached picture, a snake is seen moving towards a moon (shown as a crescentto perhaps distinguish it from the Sun) and likely indicates Rahu/Ketu about to swallow the Moon causing a lunar eclipse. The temple may have been dedicated during such an event.Thanks,-ShashiRameshwara temple, Hale Palya, Hassan District, Karnataka.JPGBHU1 LORDunread,Jul 16, 2019, 2:56:15 PM7/16/19to b-...@googlegroups.comI guess I misunderstood the mail when I first read it as it was written in personal context and thought it was meant to be sent to somebody personallyBut I really appreciate the result especially regarding the accurate timings mentioned in the mailI'm eagerly waiting for the eclipse and wish all of you clear skieskeerthi kiranunread,Jul 17, 2019, 10:08:39 AM7/17/19to BASHi Susam, Shashikiran,You guys are right. I didn't think it through.For Europe, the eclipse was already underway when the moon rose. So I was only thinking about that.But for Asia, as you guys said, the eclipse was mostly in the western sky.Regards,Keerthi You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. BHU1 LORDunread,Jul 17, 2019, 10:11:43 AM7/17/19to b-...@googlegroups.comDid anybody get some good pictures of the eclipseHere the clouds started moving SW during max eclipse and the moon was completely coveredI would really appreciate if somebody got a pic of the moon during max eclipsekeerthi kiranunread,Jul 17, 2019, 10:15:24 AM7/17/19to b-...@googlegroups.comI can't call them good photos. But I got a few from Paris from my balcony.Regards,Keerthi You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. 20190717030019__MG_1631.JPG.jpgBHU1 LORDunread,Jul 17, 2019, 10:20:27 AM7/17/19to b-...@googlegroups.comthe pictures are awesomeI really wished I had that crystal clear sky hereAjay Talwarunread,Jul 17, 2019, 10:50:55 AM7/17/19to b-...@googlegroups.comHi Bhuvan,Here is an image of last night's eclipse. This image of the Lunar eclipse was shot at 02:52 AM (I.S.T.) on 17 July, using the 14inch telescope and Hyperstar lens. Location - Tijara, Rajasthan.This image is a HDR composite of 5 images, clicked in quick succession, and varying exposures. The longer exposure was good for the darker portion of the eclipse, and the shorter exposure was good for the brighter part of the Moon, which was not inside the umbra. The 5 images were combined to show the brighter as well as the darker portions of this partial lunar eclipse together in an HDR image. Monsoon clouds can be seen all around the eclipsed moon.Ajay Talwar -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group.2019-07-17 Partial Lunar Eclipse Hyperstar HDR.jpgBHU1 LORDunread,Jul 17, 2019, 11:05:55 AM7/17/19to b-...@googlegroups.comThis picture is worth all the effort you put into itI like how to incorporated the clouds into the picture, it gives kind of a mysterious feel to itkeerthi kiranunread,Jul 17, 2019, 12:58:22 PM7/17/19to b-...@googlegroups.comHere are some good photos clicked by Prabhu Kutti, Naveen and Niranjan from our WhatsApp group.Regards,Keerthikeerthi kiranunread,Jul 17, 2019, 12:59:50 PM7/17/19to b-...@googlegroups.comAwesome image Ajay :)But don't share it with TV channels, they will use it will special effects to scare people... :D Huligun .comunread,Jul 17, 2019, 6:46:28 PM7/17/19to b-...@googlegroups.comGood photos all, thanks for sharing !!! Akarsh Simhaunread,Jul 18, 2019, 8:14:52 AM7/18/19to b-...@googlegroups.comYes, very nice to hear from Vasanth after a long long time!ashiqunread,Jul 18, 2019, 2:16:32 PM7/18/19to b-...@googlegroups.com "
        ],
        "story_type": "Normal",
        "url_raw": "https://groups.google.com/d/msg/b-a-s/9rcz9MbC5p8/2Q8txQgGBAAJ",
        "comments.comment_id": [20448578, 20449793],
        "comments.comment_author": ["bnegreve", "hluska"],
        "comments.comment_descendants": [2, 2],
        "comments.comment_time": [
          "2019-07-16T09:15:44Z",
          "2019-07-16T13:26:35Z"
        ],
        "comments.comment_text": [
          "> Solar Eclipses are Virtual. They really do not exist. [..] Lunar Eclipses are real. They are actually happening of an event on the moon.<p>During a lunar eclipse, the earth projects its shadow on the moon. During a Solar Eclipse, the moon projects its shadow on the earth. Only the shadow is smaller. I'm not sure what makes lunar eclipses more real.",
          "In May, my three year old daughter and I flew out to Vancouver Island, Canada to spend a couple of weeks with my Dad. It was my daughter’s second time out to the island, though the first time was for my Grandma’s funeral when she was six months old.<p>This email from a father to a child reminds me of the emails my Dad sent us in the lead up to our trip. I’ve never seen my Dad so excited for anything. The day of the flight, he was awake at 1am his local time to start watching the flight schedule and the weather. He wrote lots of reminders, to make sure that I packed Lauren’s identification, Pull Ups and wipes. And he wanted to make sure that Lauren had a window seat where she wouldn’t just stare out at a wing. No no no, his only granddaughter was going to have a view. (Strangely, the day of the flight was cloudy as hell until we got to the mountains, then we flew over the Rockies with barely a cloud in sight. It was as if Grandpa put in his order for weather that would give his granddaughter the best view imaginable).<p>I was pretty scared in the lead up. I hate flying at the best of times and this was my first solo flight with a three year old. Shit, I’m hardly qualified to deal with Webpack when it has a tantrum. This is a bloody human life in a plane.<p>The flight was amazing and reading my Dad’s dispatches every ten minutes added to our excitement. When we landed, my Dad and stepmother were visibly excited. My daughter ran to them and the three of them had a wonderful moment.<p>My Dad’s emails were purely about his excitement. And this dad’s email makes him sound just as excited as my Dad was. I am only going to have one child and I pray that one day, I get to be that excited about my little girl hopping on a flight to visit me. If my excited message happens to go public and it contains some factual issues, I hope to hell that the people who read it recognize it for what it is...I’ll just be a really excited dad who is doing whatever I can to pass the time before I get to see someone I love more than life! :)"
        ],
        "id": "e8f09a37-2d6c-4ab6-85a0-5089263024f1",
        "url_text": "Vasanth BRunread,Jul 15, 2019, 11:50:39 PM7/15/19to TS...@yahoogroups.com, subramanya cr, absb...@googlegroups.com, b-...@googlegroups.com, Shyamal Sarkar, ind...@googlegroups.com, Military...@yahoogroups.com, ma...@randhirmishra.com, s_chowdh...@yahoo.com, Swaga...@gmail.com, vas...@learningaccord.com AN EMAIL TO A DAUGHTER & SON-IN-LAW. Tue, 16 Jul 19 / 01:32 Dear Shirin & Arun, Place Flight M British Standard Time Indian Standard Time Duration Distance A/C Speed Alt London BA 119 D Tue, 16 Jul / 14:25 (+01:00) Tue, 16 Jul / 18:55 (+05:30) B 777 Bengaluru A Wed, 17 Jul / 00:05 (+01:00) Wed, 17 Jul / 04:35 (+05:30) 09:40 hr 8,010 km 869 km/h 11,280 mt On Wed, 17 Jul, a Partial Lunar Eclipse begins at (all IST) 01:31:43, reaches Maximum 65% at 03:00:44 and Ends at 04:29:39. You will be landing in Bengaluru, at 04:35; just 5 minutes after the Eclipse ends. Solar Eclipses are Virtual. They really do not exist. They are Localised OUR Views of the sun, from an individual on the earth. They are no different from holding an umbrella over your head, when walking under the sun. Instead of the umbrella, you are \"holding\"the moon over your head, blocking the sun, only to you, locally; only about 30 km around you. It is about 30 km radius circle, because your umbrella is about 1 mt diametre and the moon's diametre is 3,476 km; but then, it is 362,600 km to 405,600 km away. Lunar Eclipses are real. They are actually happening of an event on the moon. The earth's shadow, is actually falling on the moon. All the persons in half earth who can see the moon, can see the Eclipse, in the same manner. When you take off from London, set your watch 04 hr 30 mt head. In that watch, when it isIndia's time, 01:31:43 (correct to the second), the Eclipse begins. You can calibrate your watch, correct to the second. Please try to get a seat on the right side, so that you can get a view on the West side. Do not sit over the wing. When the Eclipse starts at 01:32, you will be over Oman (wave to Arun's sister Anita). From Oman to Bengaluru, you willfly due South-East. You do not have to crane your neck. See the moon at level, straight through your window. This is a rare opportunity, to see the entire Lunar Eclipse of 02 hr 57 mt 56 sc through the window of a plane. Take your BEST binoculars with you. If you do not have one, purchase it in Belfast or London. At 11.28 km high, above the atmosphere, your moon sight will be in crystal clear sky. As the Earth's sharply edged shadow races across the moon's surface, at about 1,000 km per hour, through your binoculars, you will see the edge of the shadow climbing up the moon's mountains and dipping below into the valleys. From the Earth's surface, the moon appears flat. In reality, the centre of the moon is 1,738 km nearer to you. From a plane, at 11 km above the Earth's surface, as the Earth's shadow's edge races across the moon's surface, your eyes will suddenly see the moon in 3 dimensions. Just intently stare at the moon. Your brain will suddenly pop up the moon into 3 dimensions. This is a million pounds worth ofexperience, which you can NEVER have fromthe Earth's surface. Looking forward to meeting you. DAD BHU1 LORDunread,Jul 16, 2019, 7:09:25 AM7/16/19to b-...@googlegroups.comNo offence but why is this on a public mailing list keerthi kiranunread,Jul 16, 2019, 7:38:52 AM7/16/19to BASHi Vasanth,Nice to see your mail after a long time :)It was a nice read... I wish I was on that flight :)I saw one error in your mail. The eclipse will happen in the eastern sky. So they should get a view on the \"East side of the plane\".Also, they can inform the crew so that the crew informs the other passengers. All the best to them. Hope they get to witness a wonderful eclipse (and may be take a photo from the cockpit).Thanks and Regards,Keerthi -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. keerthi kiranunread,Jul 16, 2019, 7:51:22 AM7/16/19to BASHi Bhu1 Lord,The mail (although written in a personal context) is informational. Also, it is a good read :)Regards,Keerthi -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. Message has been deletedSusam Palunread,Jul 16, 2019, 8:15:54 AM7/16/19to Bangalore Astronomical SocietyThe eclipse would begin at 01:32 AM IST, i.e., 00:02 AM GST at Oman when the plane is likely flying over Oman. In Muscat (Oman), the moon would rise at 06:39 PM GST in the East-southeast, cross the local meridian at 12:09 AM GST, and set at 05:40 AM GST in the West-southwest [1]. Therefore, when the eclipse would start at 00:02 AM GST, the moon would be in the eastern sky close to the local meridian at Muscat.But then most of the remaining eclipse seems to take place in the western sky. For example, in Bangalore, the moon would rise at 06:30 PM IST in the East-southeast, cross the local meridian at 12:20 AM IST, and set at 06:10 AM IST in the West-southwest [2]. Therefore, when the eclipse would end at 04:29 AM IST, the moon would be in the western sky ready to set in about 1.5 hours. It looks like most of the eclipse would indeed be visible in the western sky from this particular flight.[1]: https://www.timeanddate.com/moon/oman/muscat[2]: https://www.timeanddate.com/moon/india/bangaloreThanks,Susam -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group.Shashikiran Kolarunread,Jul 16, 2019, 2:50:55 PM7/16/19to Bangalore Astronomical SocietyYes, as Susam says, with respect to Muscat and India, the Moon spends most of its time in the Western half of the sky when it enters the Earth's umbral shadow.Muscat is 22, or about 90 minutes, West of Bangalore. So, if the partial eclipse begins at 1.30AM here, it would do so at 12.00AM at Muscat. Since this is the full moon, it's in opposition and hence transits to Western part of the sky at (local) 12.00AM. Also, the plane would be flying Eastwards, causing the Moon would always hang in the Western part of the sky thereon.That lunar eclipses always begin at the Eastern limb of the Moon was perhaps confused with the Moon being in the Eastern half of the sky?As an aside, it is likely that certain depictions on temples indicate eclipses. In the attached picture, a snake is seen moving towards a moon (shown as a crescentto perhaps distinguish it from the Sun) and likely indicates Rahu/Ketu about to swallow the Moon causing a lunar eclipse. The temple may have been dedicated during such an event.Thanks,-ShashiRameshwara temple, Hale Palya, Hassan District, Karnataka.JPGBHU1 LORDunread,Jul 16, 2019, 2:56:15 PM7/16/19to b-...@googlegroups.comI guess I misunderstood the mail when I first read it as it was written in personal context and thought it was meant to be sent to somebody personallyBut I really appreciate the result especially regarding the accurate timings mentioned in the mailI'm eagerly waiting for the eclipse and wish all of you clear skieskeerthi kiranunread,Jul 17, 2019, 10:08:39 AM7/17/19to BASHi Susam, Shashikiran,You guys are right. I didn't think it through.For Europe, the eclipse was already underway when the moon rose. So I was only thinking about that.But for Asia, as you guys said, the eclipse was mostly in the western sky.Regards,Keerthi You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. BHU1 LORDunread,Jul 17, 2019, 10:11:43 AM7/17/19to b-...@googlegroups.comDid anybody get some good pictures of the eclipseHere the clouds started moving SW during max eclipse and the moon was completely coveredI would really appreciate if somebody got a pic of the moon during max eclipsekeerthi kiranunread,Jul 17, 2019, 10:15:24 AM7/17/19to b-...@googlegroups.comI can't call them good photos. But I got a few from Paris from my balcony.Regards,Keerthi You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. 20190717030019__MG_1631.JPG.jpgBHU1 LORDunread,Jul 17, 2019, 10:20:27 AM7/17/19to b-...@googlegroups.comthe pictures are awesomeI really wished I had that crystal clear sky hereAjay Talwarunread,Jul 17, 2019, 10:50:55 AM7/17/19to b-...@googlegroups.comHi Bhuvan,Here is an image of last night's eclipse. This image of the Lunar eclipse was shot at 02:52 AM (I.S.T.) on 17 July, using the 14inch telescope and Hyperstar lens. Location - Tijara, Rajasthan.This image is a HDR composite of 5 images, clicked in quick succession, and varying exposures. The longer exposure was good for the darker portion of the eclipse, and the shorter exposure was good for the brighter part of the Moon, which was not inside the umbra. The 5 images were combined to show the brighter as well as the darker portions of this partial lunar eclipse together in an HDR image. Monsoon clouds can be seen all around the eclipsed moon.Ajay Talwar -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group. -- You received this message because you are subscribed to the Google Groups \"Bangalore Astronomical Society\" group.2019-07-17 Partial Lunar Eclipse Hyperstar HDR.jpgBHU1 LORDunread,Jul 17, 2019, 11:05:55 AM7/17/19to b-...@googlegroups.comThis picture is worth all the effort you put into itI like how to incorporated the clouds into the picture, it gives kind of a mysterious feel to itkeerthi kiranunread,Jul 17, 2019, 12:58:22 PM7/17/19to b-...@googlegroups.comHere are some good photos clicked by Prabhu Kutti, Naveen and Niranjan from our WhatsApp group.Regards,Keerthikeerthi kiranunread,Jul 17, 2019, 12:59:50 PM7/17/19to b-...@googlegroups.comAwesome image Ajay :)But don't share it with TV channels, they will use it will special effects to scare people... :D Huligun .comunread,Jul 17, 2019, 6:46:28 PM7/17/19to b-...@googlegroups.comGood photos all, thanks for sharing !!! Akarsh Simhaunread,Jul 18, 2019, 8:14:52 AM7/18/19to b-...@googlegroups.comYes, very nice to hear from Vasanth after a long long time!ashiqunread,Jul 18, 2019, 2:16:32 PM7/18/19to b-...@googlegroups.com ",
        "_version_": 1718536501320482816
      },
      {
        "story_id": 18972516,
        "story_author": "curtis",
        "story_descendants": 142,
        "story_score": 600,
        "story_time": "2019-01-22T21:11:20Z",
        "story_title": "A meteorite hit the moon during yesterday's total lunar eclipse",
        "search": [
          "A meteorite hit the moon during yesterday's total lunar eclipse",
          "https://www.newscientist.com/article/2191526-a-meteorite-hit-the-moon-during-yesterdays-total-lunar-eclipse/",
          "The meteorite impact caused a bright flash, indicated by the arrowJose M. Madiedo Observers of Mondays lunar eclipse were blessed with the first known sighting of a meteorite impact during such an event. The so-called super wolf blood moon was eagerly watched by millions of people around the world, mostly via live streaming video.During the eclipse,some people noticed a tiny flash, a brief yellow-white speck, popping up on the lunar surface during the online broadcasts. One Reddit user raised the possibility that this was a meteorite impactand othersscoured eclipse footage for evidence of the event. A flash is visible in at least three different videos.Advertisement Jose Maria Madiedo at the University of Huelva in Spain has confirmed that the impact is genuine.For years,he and his colleagues have been hoping to observe a meteorite impact on the moon during a lunar eclipse, but the brightness of these events can make that very difficult lunar meteorite impacts have been filmed before, but not during an eclipse. Read more: NASA puzzles over invisible moon impact On this occasion, Madiedo doubled the number of telescopes trained on different parts of the moon from four to eight in the hope of seeing an impact. I had a feeling, this time will be the time it will happen, says Madiedo. After the eclipse, software automatically pinpointed a flash in imagery recorded by several of his telescopes. This helps to confirm that the flashes seen by live stream-watchers were not just optical anomalies on camera sensors. I was really, really happy when this happened, says Madiedo. He notes that the flash was quite bright and it struck the moon at a moment when the eclipse was not overly luminous itself, perhaps making the strike easier to detect. Although he has not yet formally calculated an estimate for the size of the space rock that collided with the moon, Madiedo thinks it probably had a mass of about 2 kilograms and was roughly the size of a football. Experience Argentinas 2020 total solar eclipse: Witness a rare celestial event on a New Scientist Discovery Tour The combination of a darkened surface and a lot of people watching made it much more likely that the flash of impact was seen and it reminds us that the solar system is still a very dynamic place, says Robert Massey at the Royal Astronomical Society. Article amended on 23 January 2019 When this article was first published it included a video of a collision recorded in December 2018. It has been replaced with the correct video showing the January meteorite impact during the lunar eclipse. Article amended on 6 February 2019 We corrected the measure of the mass of the meteorite More on these topics: the moon eclipses "
        ],
        "story_type": "Normal",
        "url_raw": "https://www.newscientist.com/article/2191526-a-meteorite-hit-the-moon-during-yesterdays-total-lunar-eclipse/",
        "url_text": "The meteorite impact caused a bright flash, indicated by the arrowJose M. Madiedo Observers of Mondays lunar eclipse were blessed with the first known sighting of a meteorite impact during such an event. The so-called super wolf blood moon was eagerly watched by millions of people around the world, mostly via live streaming video.During the eclipse,some people noticed a tiny flash, a brief yellow-white speck, popping up on the lunar surface during the online broadcasts. One Reddit user raised the possibility that this was a meteorite impactand othersscoured eclipse footage for evidence of the event. A flash is visible in at least three different videos.Advertisement Jose Maria Madiedo at the University of Huelva in Spain has confirmed that the impact is genuine.For years,he and his colleagues have been hoping to observe a meteorite impact on the moon during a lunar eclipse, but the brightness of these events can make that very difficult lunar meteorite impacts have been filmed before, but not during an eclipse. Read more: NASA puzzles over invisible moon impact On this occasion, Madiedo doubled the number of telescopes trained on different parts of the moon from four to eight in the hope of seeing an impact. I had a feeling, this time will be the time it will happen, says Madiedo. After the eclipse, software automatically pinpointed a flash in imagery recorded by several of his telescopes. This helps to confirm that the flashes seen by live stream-watchers were not just optical anomalies on camera sensors. I was really, really happy when this happened, says Madiedo. He notes that the flash was quite bright and it struck the moon at a moment when the eclipse was not overly luminous itself, perhaps making the strike easier to detect. Although he has not yet formally calculated an estimate for the size of the space rock that collided with the moon, Madiedo thinks it probably had a mass of about 2 kilograms and was roughly the size of a football. Experience Argentinas 2020 total solar eclipse: Witness a rare celestial event on a New Scientist Discovery Tour The combination of a darkened surface and a lot of people watching made it much more likely that the flash of impact was seen and it reminds us that the solar system is still a very dynamic place, says Robert Massey at the Royal Astronomical Society. Article amended on 23 January 2019 When this article was first published it included a video of a collision recorded in December 2018. It has been replaced with the correct video showing the January meteorite impact during the lunar eclipse. Article amended on 6 February 2019 We corrected the measure of the mass of the meteorite More on these topics: the moon eclipses ",
        "comments.comment_id": [18972967, 18973434],
        "comments.comment_author": ["scrumbledober", "sizzzzlerz"],
        "comments.comment_descendants": [2, 9],
        "comments.comment_time": [
          "2019-01-22T21:56:02Z",
          "2019-01-22T22:48:18Z"
        ],
        "comments.comment_text": [
          "Scott Manley did a great quick video about this<p><a href=\"https://www.youtube.com/watch?v=Smp7TqccTpY\" rel=\"nofollow\">https://www.youtube.com/watch?v=Smp7TqccTpY</a>",
          "I know its just a coincidence that the meteor hit during a lunar eclipse while millions of people might have been watching (and probably not seeing it). But, it gives me chills to think that lump of rock has been orbiting through the solar system for possibly billions of years with its unknown fate already sealed. All it took was for the Sun and all the planets and moons to go through their cycles an uncountable number of times to bring it to its ultimate conclusion.<p>Now, unknown asteroid, your watch is done."
        ],
        "id": "01892bd5-8468-4ae8-9b6e-1009c8d5f67d",
        "_version_": 1718536439984029696
      },
      {
        "story_id": 20351953,
        "story_author": "CaliforniaKarl",
        "story_descendants": 13,
        "story_score": 53,
        "story_time": "2019-07-04T06:03:03Z",
        "story_title": "During a Solar Eclipse, What Are Plants Doing?",
        "search": [
          "During a Solar Eclipse, What Are Plants Doing?",
          "https://www.nytimes.com/2019/07/02/science/plants-solar-eclipse.html",
          "TrilobitesResearch conducted during the Great American Eclipse of 2017 suggested the suns midday disappearance shocked some plants.Credit...Dr. Mario BretfeldJuly 2, 2019As the total solar eclipse crosses South America on Tuesday, it wont just be people oohing and ahhing as the sun is blotted out.Other living things will have their own responses, too some of which we are just beginning to understand. As some scientists used the Great American Eclipse in August 2017 to watch how bees and birds dealt with sudden midday darkness, researchers in Wyoming investigated big sagebrush, a shaggy, aromatic desert shrub that grows throughout the western United States.Tracking its reactions at the leaf level, scientists saw it experience a slowdown in activity as darkness fell, followed by shock at the suns surprise return. The study, published in June in Scientific Reports, adds to a small clump of botanical eclipse research, all produced by people with the ability to wonder, even as a celestial event occurs: What are the plants getting up to?[Like the Science Times page on Facebook. | Sign up for the Science Times newsletter.]Plants havent really been well-documented during the eclipse, said Daniel Beverly, a Ph.D. student in botany and hydrology at the University of Wyoming and the papers lead author. When he heard an eclipse was coming, he saw the chance for a once-in-a-lifetime data set.Big sagebrush spends much of its life in the sun, and it covers such a large portion of the country, from Oregon down to New Mexico, Mr. Beverly said, making it a good subject for study. He and his colleagues chose a patch close to Yellowstone National Park. They set up instruments that could measure photosynthetic rate, as well as the speed of transpiration how quickly its leaves lose water.As the light faded and the temperature dropped during the 80 or so minutes before totality, Mr. Beverly and his team saw a corresponding decrease in photosynthesis and transpiration. The plant responded as if it was dusk, he said.During the two minutes and 18 seconds of complete darkness, both rates fell further. Although they did not quite reach the slowdown level of an average nighttime, it was a much more precipitous drop than would have occurred for a passing cloud.But when the sun appeared again, the shrubs were blindsided.Thats when we saw the most evident signals of stress, said Mr. Beverly. It caused a disruption in the photosynthetic pathways.Although they could not test this directly, he guesses that the shock of sudden sunlight messed with each plants circadian rhythm the internal clock that determines an organisms daily cycle of activity.Over the course of the eclipse day, the team estimated, your average big sagebrush managed about 14 percent less photosynthesis than it would have if the sun hadnt been blocked. If a plant is already drought-stressed, an eclipse might be bad news, like losing 14 percent of a days income when youre already broke, Mr. Beverly said.Their findings follow a few other studies, including one done during an eclipse over Europe in 1999 that showed changes in sap flow and transpiration in a beech tree near Ghent, Belgium. The tree held its breath during the solar eclipse, said Kathy Steppe, now a professor of plant ecology at Ghent University meaning it stopped releasing water, even as its sap kept flowing.Mr. Beverly looks forward to the 2024 eclipse, which will sweep from Mexico through to the Eastern United States, when he plans to take a closer look at crop and tree responses.Hell do one thing differently: I would try to use as much automation as possible so I could actually enjoy the eclipse, he said. Thats a big thing I missed. "
        ],
        "story_type": "Normal",
        "url_raw": "https://www.nytimes.com/2019/07/02/science/plants-solar-eclipse.html",
        "url_text": "TrilobitesResearch conducted during the Great American Eclipse of 2017 suggested the suns midday disappearance shocked some plants.Credit...Dr. Mario BretfeldJuly 2, 2019As the total solar eclipse crosses South America on Tuesday, it wont just be people oohing and ahhing as the sun is blotted out.Other living things will have their own responses, too some of which we are just beginning to understand. As some scientists used the Great American Eclipse in August 2017 to watch how bees and birds dealt with sudden midday darkness, researchers in Wyoming investigated big sagebrush, a shaggy, aromatic desert shrub that grows throughout the western United States.Tracking its reactions at the leaf level, scientists saw it experience a slowdown in activity as darkness fell, followed by shock at the suns surprise return. The study, published in June in Scientific Reports, adds to a small clump of botanical eclipse research, all produced by people with the ability to wonder, even as a celestial event occurs: What are the plants getting up to?[Like the Science Times page on Facebook. | Sign up for the Science Times newsletter.]Plants havent really been well-documented during the eclipse, said Daniel Beverly, a Ph.D. student in botany and hydrology at the University of Wyoming and the papers lead author. When he heard an eclipse was coming, he saw the chance for a once-in-a-lifetime data set.Big sagebrush spends much of its life in the sun, and it covers such a large portion of the country, from Oregon down to New Mexico, Mr. Beverly said, making it a good subject for study. He and his colleagues chose a patch close to Yellowstone National Park. They set up instruments that could measure photosynthetic rate, as well as the speed of transpiration how quickly its leaves lose water.As the light faded and the temperature dropped during the 80 or so minutes before totality, Mr. Beverly and his team saw a corresponding decrease in photosynthesis and transpiration. The plant responded as if it was dusk, he said.During the two minutes and 18 seconds of complete darkness, both rates fell further. Although they did not quite reach the slowdown level of an average nighttime, it was a much more precipitous drop than would have occurred for a passing cloud.But when the sun appeared again, the shrubs were blindsided.Thats when we saw the most evident signals of stress, said Mr. Beverly. It caused a disruption in the photosynthetic pathways.Although they could not test this directly, he guesses that the shock of sudden sunlight messed with each plants circadian rhythm the internal clock that determines an organisms daily cycle of activity.Over the course of the eclipse day, the team estimated, your average big sagebrush managed about 14 percent less photosynthesis than it would have if the sun hadnt been blocked. If a plant is already drought-stressed, an eclipse might be bad news, like losing 14 percent of a days income when youre already broke, Mr. Beverly said.Their findings follow a few other studies, including one done during an eclipse over Europe in 1999 that showed changes in sap flow and transpiration in a beech tree near Ghent, Belgium. The tree held its breath during the solar eclipse, said Kathy Steppe, now a professor of plant ecology at Ghent University meaning it stopped releasing water, even as its sap kept flowing.Mr. Beverly looks forward to the 2024 eclipse, which will sweep from Mexico through to the Eastern United States, when he plans to take a closer look at crop and tree responses.Hell do one thing differently: I would try to use as much automation as possible so I could actually enjoy the eclipse, he said. Thats a big thing I missed. ",
        "comments.comment_id": [20352477, 20355944],
        "comments.comment_author": ["bactisme", "fridgamarator"],
        "comments.comment_descendants": [2, 0],
        "comments.comment_time": [
          "2019-07-04T07:47:34Z",
          "2019-07-04T16:40:50Z"
        ],
        "comments.comment_text": [
          "Is there a difference between eclipse and bringing tour plant inside? How is it difficult to simulate a eclipse all year round ?",
          "Some data my company collected during the August 2017 eclipse in Nebraska - <a href=\"http://www.licor.com/env/newsline/2017/08/solar-eclipse-data-from-li-cor/\" rel=\"nofollow\">http://www.licor.com/env/newsline/2017/08/solar-eclipse-data...</a>"
        ],
        "id": "2dd0b42c-0046-4b6c-a2be-23d5f546f5ca",
        "_version_": 1718536497551900672
      },
      {
        "story_id": 19623087,
        "story_author": "okket",
        "story_descendants": 7,
        "story_score": 30,
        "story_time": "2019-04-10T09:29:36Z",
        "story_title": "Event Horizon Telescope Live Press Conference",
        "search": [
          "Event Horizon Telescope Live Press Conference",
          "https://www.eso.org/public/live/",
          "On 2 July 2019 the European Southern Observatory (ESO) provided a 4-hour live webcast of the 2019 La Silla Total Solar Eclipse. This was a unique opportunity to be part of the only total solar eclipse visible from an ESO Observatory for the next 212 years. The webcast was a raw feed without commentary switching between sources regularly, featuring views from three small telescopes and two camera views of spectators at the Observatory. The webcast finishes with a beautiful view of the Sun setting over the Pacific Ocean. A nice way to end a spectacular day at La Silla. Production: Francois Glasser (APICAL) Engineering: Lionel Gauze (APICAL) & Francois Glasser (APICAL) Cinematography: Francois Glasser (APICAL) & Alexandre Santerne (Aix-Marseille University/LAM) Director: Lars Lindberg Christensen The Eclipse Schedule Event02.07.2019 Local Time Chile CLT Time UT Time CEST Start of webcast 13:56:00 17:56:00 19:56:00 Start of partial eclipse (C1) 15:23:51 19:23:51 21:23:51 Start of total eclipse (C2) 16:39:24 20:39:24 22:39:24 Maximum eclipse 16:40:20 20:40:20 22:40:20 End of total eclipse (C3) 16:41:15 20:41:15 22:41:15 End of partial eclipse (C4) 17:47:16 21:47:16 23:47:16 Sunset 17:54:00 21:54:00 23:54:00 End of webcast 18:12:00 22:12:00 00:12:00 Duration, totality 01:51.7 "
        ],
        "story_type": "Normal",
        "url_raw": "https://www.eso.org/public/live/",
        "url_text": "On 2 July 2019 the European Southern Observatory (ESO) provided a 4-hour live webcast of the 2019 La Silla Total Solar Eclipse. This was a unique opportunity to be part of the only total solar eclipse visible from an ESO Observatory for the next 212 years. The webcast was a raw feed without commentary switching between sources regularly, featuring views from three small telescopes and two camera views of spectators at the Observatory. The webcast finishes with a beautiful view of the Sun setting over the Pacific Ocean. A nice way to end a spectacular day at La Silla. Production: Francois Glasser (APICAL) Engineering: Lionel Gauze (APICAL) & Francois Glasser (APICAL) Cinematography: Francois Glasser (APICAL) & Alexandre Santerne (Aix-Marseille University/LAM) Director: Lars Lindberg Christensen The Eclipse Schedule Event02.07.2019 Local Time Chile CLT Time UT Time CEST Start of webcast 13:56:00 17:56:00 19:56:00 Start of partial eclipse (C1) 15:23:51 19:23:51 21:23:51 Start of total eclipse (C2) 16:39:24 20:39:24 22:39:24 Maximum eclipse 16:40:20 20:40:20 22:40:20 End of total eclipse (C3) 16:41:15 20:41:15 22:41:15 End of partial eclipse (C4) 17:47:16 21:47:16 23:47:16 Sunset 17:54:00 21:54:00 23:54:00 End of webcast 18:12:00 22:12:00 00:12:00 Duration, totality 01:51.7 ",
        "comments.comment_id": [19624060, 19624702],
        "comments.comment_author": ["wolfram74", "okket"],
        "comments.comment_descendants": [0, 0],
        "comments.comment_time": [
          "2019-04-10T12:48:25Z",
          "2019-04-10T14:03:26Z"
        ],
        "comments.comment_text": [
          "I had a brief conversation about this and the Falcon Heavy launch with my quantum professor, who is very deep into black holes. I completely understand why they're very excited about this announcement, and I am pumped as well. But they should be a bit excited for the falcon heavy launch as well, if we had a radio telescope on the far side of the moon with a decent clock the resolution on this announcement would an order of magnitude better. That kind of project will be more feasible as launches get cheaper.\nedit: The radio telescope on the moon's data would be integrated into the rest of the networks, this would permit a virtual aperture diameter about ~50 times larger.",
          "The papers with the scientific details are here (open access):<p><a href=\"https://iopscience.iop.org/journal/2041-8205/page/Focus_on_EHT\" rel=\"nofollow\">https://iopscience.iop.org/journal/2041-8205/page/Focus_on_E...</a><p>Article in physics world with comparisons to simulations:<p><a href=\"https://physicsworld.com/a/first-images-of-a-black-hole-unveiled-by-astronomers-in-landmark-discovery/\" rel=\"nofollow\">https://physicsworld.com/a/first-images-of-a-black-hole-unve...</a><p>\"AskScience\" AMA on Reddit about the breakthrough:<p><a href=\"https://www.reddit.com/r/askscience/comments/bbknik/askscience_ama_series_we_are_scientists_here_to/\" rel=\"nofollow\">https://www.reddit.com/r/askscience/comments/bbknik/askscien...</a>"
        ],
        "id": "ff073bc9-56cc-47f5-961a-049646f8afb3",
        "_version_": 1718536469801336832
      },
      {
        "story_id": 19825059,
        "story_author": "omnibrain",
        "story_descendants": 516,
        "story_score": 460,
        "story_time": "2019-05-04T07:50:13Z",
        "story_title": "Negotiations Failed: How Oracle Killed Java EE",
        "search": [
          "Negotiations Failed: How Oracle Killed Java EE",
          "https://headcrashing.wordpress.com/2019/05/03/negotiations-failed-how-oracle-killed-java-ee/",
          "Today Eclipse Foundations president Mike Milinkovic blogged about the final result of the confidential trademark negotiations between Oracle and the Eclipse Foundation. As we remember, Oracle announced that Java EE will be open sourced to that organization and it would become true open source. After 18 months of intensive negotiations the effort has come to an end: It failed. There will be no trademark agreement. The reason simply spoken is, according to the recent board meeting minutes, that Oracle wanted to have in turn a set of inacceptable demands. Some of them would put the existence of the Eclipse Foundation at severe risk. Oracle claimed that products distributed by the Eclipse Foundation (like the Eclipse IDE) must only be bundled with Java runtimes certified particularly by Oracle and its licencees not any other vendors certification and not any uncertified runtime. Hence, the IDE and GlassFish wouldnt be vendor-neutral products anymore. This restriction was not told at the start of the negotations, it was introduced much later, while the transfer was already in progress. One could assume that it was a reaction upon the donation of IBMs OpenJ9 JVM, which is a clear threat to Oracles Java business. But once Eclipse products would be not vendor-neutral anymore, the EFs tax exemption might become void, which would mean a financial fiasco, or possibly mean the end of the organization as a hole. Hence, it not only was inacceptable, but it was simply impossibleto agree to Oracles requests, so the negotiations more or less completely failed. What is left over is not more but also not less the end of Java EE. The Eclipse Foundation may use some rather outdated code, but must not modify it. If it gets modified, it must be renamed both, the project name (like JAX-RS, which is not nice but acceptable) but also the package name (like javax.*), which means, existing applications will not run on the updated platform without recompilation of the application after intensive refactoring. Hence, it will become a completely new and incompatible platform, the worst case possible, as it not only voids the WORA (Write Once Run Anywhere) principle, it simply wont happen in reality: After 18 months virtually no application vendor really wants to spend the time and money to update all customers with recompiled versions just for the sake of a renamed platform with a dubios future. The future is unclear because Oracle already started a blocking politics at the Eclipse Foundations board, where Oracle has a seat, and where unanimous decisions are needed. Oracle now has the power, and apparently will use that power, to block the foundations future. It demonstrated that power already in a board meeting, where they had the sole vote against an otherwise unaimous move. The current reaction of the Eclipse Foundation is to demonstrate success to rescue at least some value of the intensively marketed Jakarta trademark. But at what price? For what keeping a trademark that became an empty hull now? It now is not the successor of Java EE as a global standard anymore, it is just some framework made by some foundation, and users eventually will learn and draw conclusions. Currently plans have intensivated to rename everything ASAP. But who will actually jump on that train, when it implies changing all existing applications? Eclipses Mike Milinkovic still sees the future bright. For me, the glass is not just half-empty anymore: Today it cracked into pieces. This is the day when Java EE was killed by Oracle. Find more interesting Java and Jakarta topics covered on my Youtube channel! About Markus Karg Java Guru with +30 years of experience in professional software development. I travelled the whole world of IT, starting from Sinclair's great ZX Spectrum 48K, Commodore's 4040, over S/370, PCs since legendary XT, CP/M, VM/ESA, DOS, Windows (remember 3.1?), OS/2 WARP, Linux to Android and iOS... and still coding is my passion, and Java is my favourite drug! "
        ],
        "story_type": "Normal",
        "url_raw": "https://headcrashing.wordpress.com/2019/05/03/negotiations-failed-how-oracle-killed-java-ee/",
        "url_text": "Today Eclipse Foundations president Mike Milinkovic blogged about the final result of the confidential trademark negotiations between Oracle and the Eclipse Foundation. As we remember, Oracle announced that Java EE will be open sourced to that organization and it would become true open source. After 18 months of intensive negotiations the effort has come to an end: It failed. There will be no trademark agreement. The reason simply spoken is, according to the recent board meeting minutes, that Oracle wanted to have in turn a set of inacceptable demands. Some of them would put the existence of the Eclipse Foundation at severe risk. Oracle claimed that products distributed by the Eclipse Foundation (like the Eclipse IDE) must only be bundled with Java runtimes certified particularly by Oracle and its licencees not any other vendors certification and not any uncertified runtime. Hence, the IDE and GlassFish wouldnt be vendor-neutral products anymore. This restriction was not told at the start of the negotations, it was introduced much later, while the transfer was already in progress. One could assume that it was a reaction upon the donation of IBMs OpenJ9 JVM, which is a clear threat to Oracles Java business. But once Eclipse products would be not vendor-neutral anymore, the EFs tax exemption might become void, which would mean a financial fiasco, or possibly mean the end of the organization as a hole. Hence, it not only was inacceptable, but it was simply impossibleto agree to Oracles requests, so the negotiations more or less completely failed. What is left over is not more but also not less the end of Java EE. The Eclipse Foundation may use some rather outdated code, but must not modify it. If it gets modified, it must be renamed both, the project name (like JAX-RS, which is not nice but acceptable) but also the package name (like javax.*), which means, existing applications will not run on the updated platform without recompilation of the application after intensive refactoring. Hence, it will become a completely new and incompatible platform, the worst case possible, as it not only voids the WORA (Write Once Run Anywhere) principle, it simply wont happen in reality: After 18 months virtually no application vendor really wants to spend the time and money to update all customers with recompiled versions just for the sake of a renamed platform with a dubios future. The future is unclear because Oracle already started a blocking politics at the Eclipse Foundations board, where Oracle has a seat, and where unanimous decisions are needed. Oracle now has the power, and apparently will use that power, to block the foundations future. It demonstrated that power already in a board meeting, where they had the sole vote against an otherwise unaimous move. The current reaction of the Eclipse Foundation is to demonstrate success to rescue at least some value of the intensively marketed Jakarta trademark. But at what price? For what keeping a trademark that became an empty hull now? It now is not the successor of Java EE as a global standard anymore, it is just some framework made by some foundation, and users eventually will learn and draw conclusions. Currently plans have intensivated to rename everything ASAP. But who will actually jump on that train, when it implies changing all existing applications? Eclipses Mike Milinkovic still sees the future bright. For me, the glass is not just half-empty anymore: Today it cracked into pieces. This is the day when Java EE was killed by Oracle. Find more interesting Java and Jakarta topics covered on my Youtube channel! About Markus Karg Java Guru with +30 years of experience in professional software development. I travelled the whole world of IT, starting from Sinclair's great ZX Spectrum 48K, Commodore's 4040, over S/370, PCs since legendary XT, CP/M, VM/ESA, DOS, Windows (remember 3.1?), OS/2 WARP, Linux to Android and iOS... and still coding is my passion, and Java is my favourite drug! ",
        "comments.comment_id": [19825435, 19825512],
        "comments.comment_author": ["vfc1", "bborud"],
        "comments.comment_descendants": [18, 3],
        "comments.comment_time": [
          "2019-05-04T09:40:42Z",
          "2019-05-04T10:05:41Z"
        ],
        "comments.comment_text": [
          "The Java ecosystem has been slowly dying for years, it's already the new Cobol at this stage.<p>I have the impression that a lot of the mindshare has switched to the Node and Javascript ecosystem, especially the frontend devs, via the Typescript / Angular path, which is a natural path to Java developers due to the comfort given by familiar concepts like static types, classes, etc.<p>When I used to do Java, I always found that Spring was a much better framework than Java EE, and have used it in most projects I've worked.<p>Oracle did not take a note from the Microsoft book and is really behaving that an evil corporate overlord.<p>It's clear at this stage that they bought Sun in order to slowly turn Java proprietary, and charge billions to the companies that are now fully Java-based for the next few decades.<p>I'm glad I saw the writing on the wall and switched, but the problem is that Java is still being taught a lot at schools, and school programs especially universities are hard to adapt and only change every 4-5 years or so.",
          "Oracle makes Java a risk factor in all projects. I stopped approving new Java projects in my team 2 years ago after we switched to Go. This wasn’t a decision we took lightly and it took almost a decade for me to be comfortable with leaving Java behind.<p>But it is the right thing to do. Oracle is not trustworthy."
        ],
        "id": "a5391162-109c-45fc-8d29-75b92b855722",
        "_version_": 1718536479651659776
      },
      {
        "story_id": 19572994,
        "story_author": "killyp",
        "story_descendants": 7,
        "story_score": 67,
        "story_time": "2019-04-04T14:52:11Z",
        "story_title": "Ghidra source code officially released",
        "search": [
          "Ghidra source code officially released",
          "https://github.com/NationalSecurityAgency/ghidra",
          "Ghidra Software Reverse Engineering Framework Ghidra is a software reverse engineering (SRE) framework created and maintained by the National Security Agency Research Directorate. This framework includes a suite of full-featured, high-end software analysis tools that enable users to analyze compiled code on a variety of platforms including Windows, macOS, and Linux. Capabilities include disassembly, assembly, decompilation, graphing, and scripting, along with hundreds of other features. Ghidra supports a wide variety of processor instruction sets and executable formats and can be run in both user-interactive and automated modes. Users may also develop their own Ghidra extension components and/or scripts using Java or Python. In support of NSA's Cybersecurity mission, Ghidra was built to solve scaling and teaming problems on complex SRE efforts, and to provide a customizable and extensible SRE research platform. NSA has applied Ghidra SRE capabilities to a variety of problems that involve analyzing malicious code and generating deep insights for SRE analysts who seek a better understanding of potential vulnerabilities in networks and systems. If you are a U.S. citizen interested in projects like this, to develop Ghidra and other cybersecurity tools for NSA to help protect our nation and its allies, consider applying for a career with us. Install To install an official pre-built multi-platform Ghidra release: Install JDK 11 64-bit Download a Ghidra release file Extract the Ghidra release file Launch Ghidra: ./ghidraRun (or ghidraRun.bat for Windows) For additional information and troubleshooting tips about installing and running a Ghidra release, please refer to docs/InstallationGuide.html which can be found in your extracted Ghidra release directory. Build To create the latest development build for your platform from this source repository: Install build tools: JDK 11 64-bit Gradle 6 or 7 make, gcc, and g++ (Linux/macOS-only) Microsoft Visual Studio (Windows-only) Download and extract the source: Download from GitHub $ unzip ghidra-master $ cd ghidra-master NOTE: Instead of downloading the compressed source, you may instead want to clone the GitHub repository: git clone https://github.com/NationalSecurityAgency/ghidra.git Download additional build dependencies into source repository: $ gradle -I gradle/support/fetchDependencies.gradle init Create development build: The compressed development build will be located at build/dist/. For more detailed information on building Ghidra, please read the Developer Guide. Develop User Scripts and Extensions Ghidra installations support users writing custom scripts and extensions via the GhidraDev plugin for Eclipse. The plugin and its corresponding instructions can be found within a Ghidra release at Extensions/Eclipse/GhidraDev/. Advanced Development To develop the Ghidra tool itself, it is highly recommended to use Eclipse, which the Ghidra development process has been highly customized for. Install build and development tools: Follow the above build instructions so the build completes without errors Install Eclipse IDE for Java Developers Prepare the development environment: $ gradle prepdev eclipse buildNatives Import Ghidra projects into Eclipse: File -> Import... General | Existing Projects into Workspace Select root directory to be your downloaded or cloned ghidra source repository Check Search for nested projects Click Finish When Eclipse finishes building the projects, Ghidra can be launched and debugged with the provided Ghidra Eclipse run configuration. For more detailed information on developing Ghidra, please read the Developer Guide. Contribute If you would like to contribute bug fixes, improvements, and new features back to Ghidra, please take a look at our Contributor Guide to see how you can participate in this open source project. "
        ],
        "story_type": "Normal",
        "url_raw": "https://github.com/NationalSecurityAgency/ghidra",
        "url_text": "Ghidra Software Reverse Engineering Framework Ghidra is a software reverse engineering (SRE) framework created and maintained by the National Security Agency Research Directorate. This framework includes a suite of full-featured, high-end software analysis tools that enable users to analyze compiled code on a variety of platforms including Windows, macOS, and Linux. Capabilities include disassembly, assembly, decompilation, graphing, and scripting, along with hundreds of other features. Ghidra supports a wide variety of processor instruction sets and executable formats and can be run in both user-interactive and automated modes. Users may also develop their own Ghidra extension components and/or scripts using Java or Python. In support of NSA's Cybersecurity mission, Ghidra was built to solve scaling and teaming problems on complex SRE efforts, and to provide a customizable and extensible SRE research platform. NSA has applied Ghidra SRE capabilities to a variety of problems that involve analyzing malicious code and generating deep insights for SRE analysts who seek a better understanding of potential vulnerabilities in networks and systems. If you are a U.S. citizen interested in projects like this, to develop Ghidra and other cybersecurity tools for NSA to help protect our nation and its allies, consider applying for a career with us. Install To install an official pre-built multi-platform Ghidra release: Install JDK 11 64-bit Download a Ghidra release file Extract the Ghidra release file Launch Ghidra: ./ghidraRun (or ghidraRun.bat for Windows) For additional information and troubleshooting tips about installing and running a Ghidra release, please refer to docs/InstallationGuide.html which can be found in your extracted Ghidra release directory. Build To create the latest development build for your platform from this source repository: Install build tools: JDK 11 64-bit Gradle 6 or 7 make, gcc, and g++ (Linux/macOS-only) Microsoft Visual Studio (Windows-only) Download and extract the source: Download from GitHub $ unzip ghidra-master $ cd ghidra-master NOTE: Instead of downloading the compressed source, you may instead want to clone the GitHub repository: git clone https://github.com/NationalSecurityAgency/ghidra.git Download additional build dependencies into source repository: $ gradle -I gradle/support/fetchDependencies.gradle init Create development build: The compressed development build will be located at build/dist/. For more detailed information on building Ghidra, please read the Developer Guide. Develop User Scripts and Extensions Ghidra installations support users writing custom scripts and extensions via the GhidraDev plugin for Eclipse. The plugin and its corresponding instructions can be found within a Ghidra release at Extensions/Eclipse/GhidraDev/. Advanced Development To develop the Ghidra tool itself, it is highly recommended to use Eclipse, which the Ghidra development process has been highly customized for. Install build and development tools: Follow the above build instructions so the build completes without errors Install Eclipse IDE for Java Developers Prepare the development environment: $ gradle prepdev eclipse buildNatives Import Ghidra projects into Eclipse: File -> Import... General | Existing Projects into Workspace Select root directory to be your downloaded or cloned ghidra source repository Check Search for nested projects Click Finish When Eclipse finishes building the projects, Ghidra can be launched and debugged with the provided Ghidra Eclipse run configuration. For more detailed information on developing Ghidra, please read the Developer Guide. Contribute If you would like to contribute bug fixes, improvements, and new features back to Ghidra, please take a look at our Contributor Guide to see how you can participate in this open source project. ",
        "comments.comment_id": [19580459, 19581303],
        "comments.comment_author": ["ChrisRR", "ryacko"],
        "comments.comment_descendants": [1, 0],
        "comments.comment_time": [
          "2019-04-05T07:24:50Z",
          "2019-04-05T10:47:48Z"
        ],
        "comments.comment_text": [
          "I thought the source was released at the same time as the tool...",
          "Someone, with the time to be project maintainer, fork it and license it under the Crockford license.<p><a href=\"https://en.m.wikipedia.org/wiki/Douglas_Crockford#%22Good,_not_Evil%22\" rel=\"nofollow\">https://en.m.wikipedia.org/wiki/Douglas_Crockford#%22Good,_n...</a>"
        ],
        "id": "6904e4ee-4c9b-4893-a393-f7c5099bea4a",
        "_version_": 1718536467391709184
      },
      {
        "story_id": 21195196,
        "story_author": "HNLurker2",
        "story_descendants": 24,
        "story_score": 54,
        "story_time": "2019-10-08T18:10:47Z",
        "story_title": "Decoding the Ancient Greek Astronomical Calculator: Antikythera Mechanism",
        "search": [
          "Decoding the Ancient Greek Astronomical Calculator: Antikythera Mechanism",
          "https://fermatslibrary.com/s/decoding-the-ancient-greek-astronomical-calculator-known-as-the-antikythera-mechanism",
          "LETTERS Decoding the ancient Greek astronomical calculator known as the Antikythera Mechanism T. Freeth 1,2 , Y. Bitsakis 3,5 , X. Moussas 3 , J. H. Seiradakis 4 , A. Tselikas 5 , H. Mangou 6 , M. Zafeiropoulou 6 , R. Hadland 7 , D. Bate 7 , A. Ramsey 7 , M. Allen 7 , A. Crawley 7 , P. Hockley 7 , T. Malzbender 8 , D. Gelb 8 , W. Ambrisco 9 & M. G. Edmunds 1 The Antikythera Mechanism is a unique Greek geared device, con- structed around the end of the second century BC. It is known 19 that it calculated and displayed celestial information, particularly cycles such as the phases of the moon and a luni-solar calendar. Calendars were important to ancient societies 10 for timing agricul- tural activity and fixing religious festivals. Eclipses and planetary motions were often interpreted as omens, while the calm regular- ity of the astronomical cycles must have been philosophically attractive in an uncertain and violent world. Named after its place of discovery in 1901 in a Roman shipwreck, the Antikythera Mechanism is technically more complex than any known device for at least a millennium afterwards. Its specific functions have remained controversial 1114 because its gears and the inscriptions upon its faces are only fragmentary. Here we report surface imaging and high-resolution X-ray tomography of the surviving fragments, enabling us to reconstruct the gear function and double the number of deciphered inscriptions. The mechanism predicted lunar and solar eclipses on the basis of Babylonian arithmetic- progression cycles. The inscriptions support suggestions of mech- anical display of planetary positions 9,14,15 , now lost. In the second century BC, Hipparchos developed a theory to explain the irregu- larities of the Moons motion across the sky caused by its elliptic orbit. We find a mechanical realization of this theory in the gear- ing of the mechanism, revealing an unexpected degree of technical sophistication for the period. The bronze mechanism (Fig. 1), probably hand-driven, was ori- ginally housed in a wooden-framed case 1 of (uncertain) overall size 315 3 190 3 100 mm (Fig. 2). It had front and back doors, with astronomical inscriptions covering much of the exterior of the mech- anism. Our new transcriptions and translations of the Greek texts are given in Supplementary Note 2 (glyphs and inscriptions). The detailed form of the lettering can be dated to the second half of the second century BC, implying that the mechanism was constructed during the period 150100 BC, slightly earlier than previously sug- gested 1 . This is consistent with a date of around 8060 BC for the wreck 1,16 from which the mechanism was recovered by some of the first underwater archaeology. We are able to complete the recon- struction 1 of the back door inscription with text from fragment E, and characters from fragments A and F (see Fig. 1 legend for fragment nomenclature). The front door is mainly from fragment G. The text is astronomical, with many numbers that could be related to planetary motions; the word sterigmos (STGRICMOS, translated as sta- tion or stationary point) is found, meaning where a planets appar- ent motion changes direction, and the numbers may relate to planetary cycles. We note that a major aim of this investigation is to set up a data archive to allow non-invasive future research, and access to this will start in 2007. Details will be available on www.an- tikythera-mechanism.gr. The back door inscription mixes mechanical terms about con- struction (trunnions, gnomon, perforations) with astronom- ical periods. Of the periods, 223 is the Saros eclipse cycle (see Box 1 for a brief explanation of astronomical cycles and periods). We discover the inscription spiral divided into 235 sections, which is 1 Cardiff University, School of Physics and Astronomy, Queens Buildings, The Parade, Cardiff CF24 3AA, UK. 2 Images First Ltd, 10 Hereford Road, South Ealing, London W5 4SE, UK. 3 National and Kapodistrian University of Athens, Department of Astrophysics, Astronomy and Mechanics, Panepistimiopolis, GR-15783, Zographos, G reece. 4 Aristotle University of Thessaloniki, Department of Physics, Section of Astrophysics, Astronomy and Mechanics, GR-54124 Thessaloniki, Greece. 5 Centre for History and Palaeography, National Bank of Greece Cultural Foundation, P. Skouze 3, GR-10560 Athens, Greece. 6 National Archaeological Museum of Athens, 1 Tositsa Str., GR-10682 Athens, Greece. 7 X-Tek Systems Ltd, Tring Business Centre, Icknield Way, Tring, Hertfordshire HP23 4JX, UK. 8 Hewlett-Packard Laboratories, 1501 Page Mill Road, Palo Alto, California 94304, USA. 9 Foxhollow Technologies Inc., 740 Bay Road, Redwood City, California 94063, USA. Figure 1 | The surviving fragments of the Antikythera Mechanism. The 82 fragments that survive in the National Archaeological Museum in Athens are shown to scale. A key and dimensions are provided in Supplementary Note 1 (fragments). The major fragments A, B, C, D are across the top, starting at top left, with E, F, G immediately below them. 27 hand-cut bronze gears are in fragment A and one gear in each of fragments B, C and D. Segments of display scales are in fragments B, C, E and F. A schematic reconstruction is given in Fig. 2. It is not certain that every one of the remaining fragments (numbered 175) belong to the mechanism. The distinctive fragment A, which contains most of the gears, is approximately 180 3 150 mm in size. We have used three principal techniques to investigate the structure and inscriptions of the Antikythera Mechanism. (1) Three-dimensional X-ray microfocus computed tomography 24 (CT), developed by X-Tek Systems Ltd. The use of CT has been crucial in making the text legible just beneath the current surfaces. (2) Digital optical imaging to reveal faint surface detail using polynomial texture mapping (PTM) 25,26 , developed by Hewlett- Packard Inc. (3) Digitized high-quality conventional film photography. Vol 444 | 30 November 2006 | doi:10.1038/nature05357 587 Natu re Pu blishin g Gro u p 2 0 0 6 the key to understanding the function 6 of the upper back dial. The references to golden little sphere and little sphere probably refer to the front zodiac display for the Sun and Moonincluding phase for the latter. The text near the lower back dial includes Pharos and from south (about/around).Spain (ISPANIA) ten. These geograph- ical references, together with previous readings 1 of towards the east, west-north-west and west-south-west suggest an eclipse function for the dial, as solar eclipses occur only at limited geograph- ical sites, and winds were often recorded 1719 in antiquity with eclipse observations. Possibly this information was added to the mechanism during use. Turning to the dials themselves, the front dial displays the position of the Sun and Moon in the zodiac, and a corresponding calendar 1 of 365 days that could be adjusted for leap years. Previously 1 , it was suggested that the upper back dial might have five concentric rings with 47 divisions per turn, showing the 235 months of the 19-year Metonic cycle. A later proposal 5 augments this with the upper sub- sidiary dial showing the 76-year Callippic cycle. Our optical and X-ray microfocus computed tomography (CT) imaging confirms these proposals, with 34 scale markings discovered on the upper back dial. On the basis of a statistical analysis analogous to that described for gear tooth counts below, we confirm the 235 total divisions. We also find from the CT that the subsidiary dial is indeed divided into quadrants 1,6 , as required for a Callippic dial. In agreement with the back door inscription, we also substantiate the perceptive proposal 5,20 that the dial is in fact a spiral, made from semicircular arcs displaced Figure 2 | A schematic view of the mechanism to illustrate the position of major inscriptions and dials. The front dial has two concentric scales. The inner scale shows the Greek zodiac with 360 divisions. There are occasional Greek letters denoting references to the Parapegma inscription, and we add three further reference letters (Z, H, H) to Prices description 1 . The Parapegma is a star almanac showing rising and settings at dawn or evening of particular stars or constellations, which we will discuss elsewhere. Its form is consistent with a date of late second century BC. The outer (originally) movable scale is a calendar carrying the Egyptian names of the months with Greek letters. The Egyptian calendar of 365 days, with twelve 30-day months and 5 extra (epagomenai) days was in standard use in Greek astronomy. The effect of the extra quarter day in a year could be corrected by turning the scale one day every four yearsand a sequence of holes to take a locking pin is observed under the scale. We find that spacing of the holes is indeed what would be expected for a total of 365 days, with a possible range 363365. The position of the Sun and Moon would have been indicated by pointers across the dial scales, and a device 7 showing the phase of the Moon was probably carried round on the lunar pointer. It is not clear whether the Sun position pointer would have been separated from a date pointer, or whether any planetary positions might have been displayed. The spiral upper back dial displays the luni-solar Metonic sequence of 235 lunar months with a subsidiary dial showing the Callippic cycle, while the spiral lower back dial displays the 223-lunar-month Saros eclipse cycle with a subsidiary dial showing the Exeligmos cycle. Box 1 | Astronomical cycles known to the Babylonians The lunar (or synodic) month is the interval between the Moon being at the same phasefor example, full moon to full moon. The Metonic cycle results from the close equality of 19 years to 235 lunar months. It represents the return to the same phase of the Moon on the same date in the year. After the cycle, the Sun, Moon and Earth are back in nearly the same relative orientations. The Moon appears to return to the same point in the sky relative to the zodiac in a sidereal month, and in 19 years there are 235 1 19 5 254 sidereal months. The 76-year Callippic cycle is four Metonic cycles minus one dayand improves the accuracy of reconciling solar years with whole numbers of lunar months. The Saros is an eclipse repeat cycle. If either a solar or lunar eclipse occurs, a very similar eclipse will occur 223 lunar months later 23 .A record of past eclipses can thus be used to predict future occurrences. The cycle arises from the coincidence of three orbital periods of the Moon. These are: (1) same phase to same phase, 223 synodic monthseclipses will of course only occur at new or full Moon in the month; (2) the lunar crossing of the Earth Sun orbital plane, 242 draconitic monthseclipses can only occur near these points (nodes) of co-alignment; (3) similar Earth Moon distances which occur on the period from apogee to apogee of the Moons orbit, 239 anomalistic months. The distance will determine the magnitude of the eclipse, ensuring the similarity of eclipses at the period of the cycle. The Saros cycle is not an integer number of days (6,585M), causing the eclipses in successive cycles to be displaced by eight hours in time (and solar eclipses, only visible at limited geographical locations, to be displaced by 120u in longitude). True repeats come after 3 Saros cycles, the 54-year Exeligmos cycle, but not with identical solar eclipse paths. LETTERS NATURE | Vol 444 | 30 November 2006 588 Natu re Pu blishin g Gro u p 2 0 0 6 to two centres on the vertical midline. In the CT of fragment B we find a new feature that explains why the dial is a spiral: a pointer-follower device (Fig. 3) travelled around the spiral groove to indicate which month (across the five turns of the scale) should be read. From our CT data of the 48 scale divisions observed in fragments A, E and F, we establish 223 divisions in the four-turn 5,20 spiral on the lower back dial, the spiral starting at the bottom of the dial. This is the Saros eclipse cycle, whose number is on the back door inscription. The 54-year Exeligmos cycle of three Saros cycles is shown on the lower subsidiary dial. Between the scale divisions of the Saros dial we have identified 16 blocks of characters, or glyphs (see Supplementary Note 2 (glyphs and inscriptions)) at intervals of one, five and six months. These are eclipse predictions and contain either S for a lunar eclipse (from SELGNG, Moon) or G for a solar eclipse (from GLIOS, Sun) or both. A correlation analysis (analogous to DNA sequence matching) with historic eclipse data 21 (all modern eclipse data and predictions in our work are from this reference) indicates that over a period of 400 1 BC, the sequence of eclipses marked by the identified glyphs would be exactly matched by 121 possible start dates. The matching only occurs if the lunar month starts at first crescent, and confirms this choice of month start in the mechanism. The sequences of eclipses can then be used to predict the expected position of glyphs on the whole dial, as seen in Fig. 4. The dial starts and finishes with an eclipse. Although Ptolemy indicates that the Greeks recorded eclipses in the second century BC, the Babylonian Saros canon 1719 is the only known source of sufficient data to construct the dial. The functions of the mechanism are determined by the tooth counts of the gears. These are based mainly on the CT, using angular measurement from a nominal centre to the remains of tooth tips. In a few cases all teeth can be seen, but many gears are incomplete. Counts are established by fitting models with regularly spaced teeth and minimising the r.m.s. deviation from the measurementsvarying the centre in software (when unclear) to find the best-fit solution or solutions (see Supplementary Note 3 (gears)). We have adopted a systematic nomenclature of lower case letters for the axis of the gear, with numbering increasing with ordering from the front of the mech- anism. Hypothetical (lost) gears are denoted by italics. Several models have been proposed for the gear trains 1,2,46,8 . We agree with the assumption of four missing gears (n1, n2, p1, p2) to drive the Metonic and Callippic dials 4 . We propose a new reconstruc- tion for the other trains, which uses all extant gears (except the lone r1 0 1 2 3 4 5 cm Figure 4 | Reconstruction of the back dials. A composite of fragments A, B, E and F. The Metonic calendar is at top, with its subsidiary Callippic dial. The Saros eclipse cycle is below, with its subsidiary Exeligmos dial. The 16 observed eclipse glyphs are shown in turquoise on the Saros dial, with 35 hypothetical glyphs in violet. The hypothetical glyphs are based on the criterion that 99% of the 121 sequences exactly matching the observed glyphs have an eclipse at the month position. Both main dials would have a pointer-follower (see Fig. 3) to indicate the relevant lunar month on the spiral. The monthly divisions on the Metonic upper back dial are not simply scribed directly across all five turns, as might be expected for simplicity of construction. There are small misalignments, implying a systematic attempt at marking full (30-day) and hollow (29-day) months. The incomplete data do not allow good analysis, other than a hint of bimodality in the interval distribution. If the marking out of the scale were carried out using the mechanisms gearing, then this would greatly pre-date known dividing engines 27 by many centuries. Figure 3 | The pointer-follower lunar month indicator of the upper back dial. On the left, false-colour sections through CT images, analysed with VGStudio Max software by Volume Graphics GmbH. These show two views at right angles of the pointer-follower in the Metonic dial in fragment B. On the right, a computer reconstruction of the device from two different angles (with the Metonic scale omitted for clarity). The pin was constrained to follow the groove between the spiral scales (the scale is shown in Fig. 4), causing the device to slide along the month pointer to indicate which ring on the spiral scale specified the month. A similar pointer-follower would have been present on the lower back (Saros) dial. The Metonic dial would have required re- setting every 19 years, the Saros dial after 18 years. The groove-pin may have been held in place by the small pin through the front of the device, enabling its removal for re-setting. NATURE | Vol 444 | 30 November 2006 LETTERS 589 Natu re Pu blishin g Gro u p 2 0 0 6 from the separate fragment D). The proposed model is shown in Fig. 5. We require the assumption of only one further gear (m3), whose proposed shaft is clearly broken off in the CT. A detailed description is contained in Supplementary Note 3 (gears). Of particular note is the dual use of the large gear, e3, at the back of the mechanism, which has found no use in previous models. In our model, it is powered by m3 as part of a fixed-axis train that turns the Saros and Exeligmos dials for eclipse prediction, and also doubles as the epicyclic table for the gears k1, k2. These are part of epicyclic gearing that calculates the theory of the irregular motion of the moon, developed by Hipparchos some time between 146 and 128 BC (ref. 22)the first anomaly, caused by its elliptical orbit about the Earth. The period of this anomaly is the period from apogee to apogee (the anomalistic month). To realize this theory, the mean sidereal lunar motion is first calculated by gears on axes c, d and e and this is then fed into the epicyclic system. As explained in Fig. 6, a pin- and-slot device on the epicyclic gears k1 and k2, clearly seen in the CT, provides the variation. This was previously identified 4 , but rejected as a lunar mechanism. The remarkable purpose of mounting the pin-and-slot mechanism on the gear e3 is to change the period of variation from sidereal month (that is, the time taken for the Moon to orbit the Earth relative to the zodiac), which would occur if k1 and k2 were on fixed axes, to anomalistic monthby carrying the gears epicyclically at a rate that is the difference between the rates of the Front dials Lunar phase Lost epicyclic gearing Pin and slot Hipparchos lunar mechanism Possibly Hipparchos solar mechanism and planetary mechanisms Hipparchos sidereal month Year Back dials Luni-solar calendar Input Eclipse prediction Saros 4Metonic 5Callippic Exeligmos Zodiac Egyptian calendar Parapegma Figure 5 | New reconstruction of the gear trains. A schematic sectional diagram (not to scale) of the gearing, following the style of Price 1 and Wright 4 . The viewpoint is looking down from the top right of the mechanism, and is stretched in the direction of the main axes to show the structure. Features that are outlined or labelled in red are hypothetical. Gears are lettered with their shaft, and numbered with increasing distance from the front dial. The two-or-three digit number on the gear is its actual or assumed tooth count (see Supplementary Note 3 (gears)). Hypothetical gears n1, n2, p1, p2 have been proposed previously, the gear m3 on the broken-off shaft m is our addition. All gears, except the lone one in fragment D, are now accounted for in the mechanism. The function of the trains is outlined in the text. We find no evidence in the CT for an idler wheel carried on e3 and between e5 and k1 or between k2 and e6, as has been previously proposed 1,2,4 . The CT shows a pin through axis e between gears e1 and e2. We believe its purpose is to retain the square-bossed e1 on the shaft, but its passage right through the axis rules out previous reconstructions 1,2,4 where e1 and e2 were joined by an outer pipe rotating around the shaft e. Figure 6 | The Hipparchos lunar mechanism mounted on gear e3. The figure is based on a CT slice of part of fragment A, showing (top) shaft e and (bottom) shaft k. The complete geometry cannot be seen in a single CT slice. The two gears on the e axis (e5 and e6) are coaxial, while the two k gears rotate on slightly displaced axes. k1 has a pin on its face that engages with a radial slot in k2 (and this was previously reported 5 ). In the figure the pitch circles of e5 and k1 are shown in turquoise and those of e6 and k2 in pink. The gear e5 drives k1, which drives k2 via the pin-and-slot, introducing a quasi-sinusoidal variation in the motion, which is then transmitted to e6. Our estimate of the distance between the arbors on the k gears is about 1.1 mm, with a pin distance of 9.6 mm, giving an angular variation of 6.5u. According to Ptolemy 28 , Hipparchos made two estimates for a lunar anomaly parameter, based on eclipse data, which would require angular variations of 5.9u or 4.5u herealthough estimates of the anomaly from Babylonian astronomy were generally larger. The difference from our estimated value is probably not significant given the difficulty of precise measurement of the axes in the CT. The harmonic variation, together with the effect of carrying the gears on e3 (which rotates at the period of the Moons apogee around the Earth), would simulate the correct variation for the Moons mean (sidereal) rotation rate on the front dial. An (unexplained) regular pentagon is visible at the centre of gear e5. It is tempting to associate the conception of the mechanism with Hipparchos himself, but he was not the first to assume eccentric or epicyclic models. LETTERS NATURE | Vol 444 | 30 November 2006 590 Natu re Pu blishin g Gro u p 2 0 0 6 sidereal and anomalistic months, that is, at the rate of rotation of about 9 years of the Moons apogee. Gears with 53 teeth are awkward to divide. So it may seem sur- prising that the gearing includes two such gears (f1, l2), whose effects cancel in the train leading to the Saros dial. But the gearing has been specifically designed so that the epicyclic table e3 turns at the rate of rotation of the Moons apogeethe factor 53 being derived from the calculation of this rotation from the Metonic and Saros cycles, which are the bases for all the prime factors in the tooth counts of the gears. The establishment of the 53-tooth count of these gears is powerful confirmation of our proposed model of Hipparchos lunar theory. The output of this complex system is carried from e6 back through e3 and thence, via e1 and b3, to the zodiac scale on the front dial and the lunar phase 7 mechanism. Our CT confirms the complex structure of axis e that this model entails. The Antikythera Mechanism shows great economy and ingenuity of design. It stands as a witness to the extraordinary technological potential of Ancient Greece, apparently lost within the Roman Empire. Received 10 August; accepted 17 October 2006. 1. Price, D. de S. Gears from the Greeks: The Antikythera Mechanism A calendar computer from ca. 80 BC. Trans Am. Phil. Soc. New Ser. 64, 1 70 (1974); reprinted by Science History Publications, New York (1975). 2. Wright, M. T. Epicyclic gearing and the Antikythera Mechanism, Part I. Antiquar. Horol. 27, 270 279 (2003). 3. Wright, M. T., Bromley, A. G. & Magou, H. Simple X-ray tomography and the Antikythera Mechanism. PACT J. Eur. Study Group Phys. Chem. Biol. Math. Tech. Appl. Archaeol. 45, 531 543 (1995). 4. Wright, M. T. The Antikythera Mechanism: a New Gearing Scheme. Bull. Sci. Instrum. Soc. 85, 2 7 (2005). 5. Wright, M. T. Epicyclic gearing and the Antikythera Mechanism, Part II. Antiquar. Horol. 29, 51 63 (2005). 6. Wright, M. T. Counting months and years: The upper back dial of the Antikythera Mechanism. Bull. Sci. Instrum. Soc. 87, 8 13 (2005). 7. Wright, M. T. The Antikythera Mechanism and the early history of the moon- phase display. Antiquar. Horol. 29, 319 329 (2006). 8. Wright, M. T. in Proc. 2nd Int. Conf. on Ancient Greek Technology (ed. Tassios, Th.) 49 60 (Technical Chamber of Greece, Athens, 2006). 9. Wright, M. T. A planetarium display for the Antikythera Mechanism. Horol. J. 144(5), 169 173 (2002); erratum 144, 193 (2002). 10. North, J. D. The Fontana History of Astronomy and Cosmology (Fontana, London, 1994). 11. Bromley, A. G. The Antikythera Mechanism. Horol. J. 132, 412 415 (1990). 12. Bromley, A. G. in Bassernet Vol. 2, No. 3 (Basser Department of Computer Science, Univ. Sydney, June, 1993). 13. Freeth, T. The Antikythera Mechanism: 1. Challenging the classic research. Mediterr. Archaeol. Archaeom. 2, 21 35 (2002). 14. Edmunds, M. & Morgan, P. The Antikythera Mechanism: still a mystery of Greek astronomy? Astron. Geophys. 41, 6.10 6.17 (2000). 15. Freeth, T. The Antikythera Mechanism: 2. Is it Posidonius orrery? Mediterr. Archaeol. Archaeom. 2, 45 58 (2002). 16. Illsley, J. S. History and Archaeology of the ShipLecture Notes. http:// cma.soton.ac.uk/HistShip/shlect36.htm (1998). 17. Stephenson, F. R. Historical Eclipses and Earths Rotation (Cambridge Univ. Press, Cambridge, UK, 1997). 18. Steele, J. M. Observations and Predictions of Eclipse Times by Early Astronomers (Kluwer Academic, Dordrecht, 2000). 19. Steele, J. M. Eclipse prediction in Mesopotamia. Arch. Hist. Exact Sci. 54, 421 454 (2000). 20. Wright, M. T. The Scholar, the Mechanic and the Antikythera Mechanism. Bull. Sci. Instrum . Soc. 80, 4 11 (2003). 21. Espenak, F. NASA Eclipse Home Page. http://sunearth.gsfc.nasa.gov/eclipse/ eclipse.html (2005). 22. Jones, A. The adaptation of Babylonian methods in Greek numerical astronomy. Isis 82, 440 453 (1991). 23. Britton, J. P. in Die Rolle der Astronomie in den Kulturen Mesopotamiens (ed. Galter, H. D.) 61 76 (rm-Druck & Vergansgesellschaft, Graz, 1993). 24. X-Tek Systems Ltd. 3-D computed tomography. http://www.xtek.co.uk/ct/ (2006). 25. Malzbender, T. & Gelb, D. Polynomial texture mapping. http:// www.hpl.hp.com/research/ptm/ (2006). 26. Brooks, M. Tricks of the light. New Sci. 170, 38 49 (2001). 27. Chapman, A. Dividing the Circle (Wiley, Chichester, 1995). 28. Toomer, G. J. Ptolemys Almagest (transl. Toomer, G. J.) (Princeton Univ. Press, Princeton, New Jersey, 1998). Supplementary Information is linked to the online version of the paper at www.nature.com/nature. Acknowledgements This work was financed by the Leverhulme Trust, the Walter Hudson Bequest, the University of Athens Research Committee and the Cultural Foundation of the National Bank of Greece. For essential support we thank the Ministry of Culture, Greece (P. Tatoulis), and the National Archaeological Museum of Athens (N. Kalts as). We acknowledge help and advice from J. Ambers, J. Austin, G. Dermody, H. Forsyth, I. Freestone, P. Haycock, V. Horie, A. Jones, M. Jones, P. Kipouros, H. Kritzas, J. Lossl, G. Makris, A. Ray, C. Reinhart, A. Valassopoulos, R. Westgate, T. Whiteside, S. Wright and C. Xenikakis. Author Contributions T.F. carried out most of the CT analysis of structure and its interpretation. Y.B., A.T. and X.M. read, transcribed and translated the inscriptions. H.M and M.Z. catalogued the fragments, provided guidance on X-ray examination, and measured the fragments with J.H.S. R.H. led the team (D.B., A.R., M.A., A.C. and P.H.) that built and operated the Bladerunner CT machine, and provided CT reconstructions and advice. T.M., D.G. and W.A. built, operated and provided software for the PTM. M.G.E. was academic lead, and undertook the statistical analysis. T.F. and Y.B. organised the logistics of the experimental work, with inter-agency liaison by X.M. and J.H.S. The manuscript was written by T.F. and M.G.E. including material from Y.B., A.T., X.M., J.H.S., H.M. and M.Z. T.F. designed the illustrations. Author Information Reprints and permissions information is available at www.nature.com/reprints. The authors declare no competing financial interests. Correspondence and requests for materials should be addressed to M.G.E. (mge@astro.cf.ac.uk). NATURE | Vol 444 | 30 November 2006 LETTERS 591 Natu re Pu blishin g Gro u p 2 0 0 6 View publication statsView publication stats "
        ],
        "story_type": "Normal",
        "url_raw": "https://fermatslibrary.com/s/decoding-the-ancient-greek-astronomical-calculator-known-as-the-antikythera-mechanism",
        "comments.comment_id": [21195796, 21195905],
        "comments.comment_author": ["arnado", "coldcode"],
        "comments.comment_descendants": [4, 2],
        "comments.comment_time": [
          "2019-10-08T18:58:56Z",
          "2019-10-08T19:06:43Z"
        ],
        "comments.comment_text": [
          "He's been scarce for a while, but Clickspring on youtube has a series on rebuilding the Antikythera Mechanism. It's quite fascinating.<p><a href=\"https://www.youtube.com/channel/UCworsKCR-Sx6R6-BnIjS2MA/videos\" rel=\"nofollow\">https://www.youtube.com/channel/UCworsKCR-Sx6R6-BnIjS2MA/vid...</a>",
          "It's easy today to imagine we are smarter than people 2000+ years ago, but it's more like we are standing on the shoulders of a ton of generations before us. I always wonder if I went back in time 2000 years from today, if I would be able to translate my knowledge at all into the limitations of back then. The folks who built this only knew what they knew back then or could imagine, but were still able to build this complex machine."
        ],
        "id": "373ed42f-a561-4722-8d29-1d8816a9108e",
        "url_text": "LETTERS Decoding the ancient Greek astronomical calculator known as the Antikythera Mechanism T. Freeth 1,2 , Y. Bitsakis 3,5 , X. Moussas 3 , J. H. Seiradakis 4 , A. Tselikas 5 , H. Mangou 6 , M. Zafeiropoulou 6 , R. Hadland 7 , D. Bate 7 , A. Ramsey 7 , M. Allen 7 , A. Crawley 7 , P. Hockley 7 , T. Malzbender 8 , D. Gelb 8 , W. Ambrisco 9 & M. G. Edmunds 1 The Antikythera Mechanism is a unique Greek geared device, con- structed around the end of the second century BC. It is known 19 that it calculated and displayed celestial information, particularly cycles such as the phases of the moon and a luni-solar calendar. Calendars were important to ancient societies 10 for timing agricul- tural activity and fixing religious festivals. Eclipses and planetary motions were often interpreted as omens, while the calm regular- ity of the astronomical cycles must have been philosophically attractive in an uncertain and violent world. Named after its place of discovery in 1901 in a Roman shipwreck, the Antikythera Mechanism is technically more complex than any known device for at least a millennium afterwards. Its specific functions have remained controversial 1114 because its gears and the inscriptions upon its faces are only fragmentary. Here we report surface imaging and high-resolution X-ray tomography of the surviving fragments, enabling us to reconstruct the gear function and double the number of deciphered inscriptions. The mechanism predicted lunar and solar eclipses on the basis of Babylonian arithmetic- progression cycles. The inscriptions support suggestions of mech- anical display of planetary positions 9,14,15 , now lost. In the second century BC, Hipparchos developed a theory to explain the irregu- larities of the Moons motion across the sky caused by its elliptic orbit. We find a mechanical realization of this theory in the gear- ing of the mechanism, revealing an unexpected degree of technical sophistication for the period. The bronze mechanism (Fig. 1), probably hand-driven, was ori- ginally housed in a wooden-framed case 1 of (uncertain) overall size 315 3 190 3 100 mm (Fig. 2). It had front and back doors, with astronomical inscriptions covering much of the exterior of the mech- anism. Our new transcriptions and translations of the Greek texts are given in Supplementary Note 2 (glyphs and inscriptions). The detailed form of the lettering can be dated to the second half of the second century BC, implying that the mechanism was constructed during the period 150100 BC, slightly earlier than previously sug- gested 1 . This is consistent with a date of around 8060 BC for the wreck 1,16 from which the mechanism was recovered by some of the first underwater archaeology. We are able to complete the recon- struction 1 of the back door inscription with text from fragment E, and characters from fragments A and F (see Fig. 1 legend for fragment nomenclature). The front door is mainly from fragment G. The text is astronomical, with many numbers that could be related to planetary motions; the word sterigmos (STGRICMOS, translated as sta- tion or stationary point) is found, meaning where a planets appar- ent motion changes direction, and the numbers may relate to planetary cycles. We note that a major aim of this investigation is to set up a data archive to allow non-invasive future research, and access to this will start in 2007. Details will be available on www.an- tikythera-mechanism.gr. The back door inscription mixes mechanical terms about con- struction (trunnions, gnomon, perforations) with astronom- ical periods. Of the periods, 223 is the Saros eclipse cycle (see Box 1 for a brief explanation of astronomical cycles and periods). We discover the inscription spiral divided into 235 sections, which is 1 Cardiff University, School of Physics and Astronomy, Queens Buildings, The Parade, Cardiff CF24 3AA, UK. 2 Images First Ltd, 10 Hereford Road, South Ealing, London W5 4SE, UK. 3 National and Kapodistrian University of Athens, Department of Astrophysics, Astronomy and Mechanics, Panepistimiopolis, GR-15783, Zographos, G reece. 4 Aristotle University of Thessaloniki, Department of Physics, Section of Astrophysics, Astronomy and Mechanics, GR-54124 Thessaloniki, Greece. 5 Centre for History and Palaeography, National Bank of Greece Cultural Foundation, P. Skouze 3, GR-10560 Athens, Greece. 6 National Archaeological Museum of Athens, 1 Tositsa Str., GR-10682 Athens, Greece. 7 X-Tek Systems Ltd, Tring Business Centre, Icknield Way, Tring, Hertfordshire HP23 4JX, UK. 8 Hewlett-Packard Laboratories, 1501 Page Mill Road, Palo Alto, California 94304, USA. 9 Foxhollow Technologies Inc., 740 Bay Road, Redwood City, California 94063, USA. Figure 1 | The surviving fragments of the Antikythera Mechanism. The 82 fragments that survive in the National Archaeological Museum in Athens are shown to scale. A key and dimensions are provided in Supplementary Note 1 (fragments). The major fragments A, B, C, D are across the top, starting at top left, with E, F, G immediately below them. 27 hand-cut bronze gears are in fragment A and one gear in each of fragments B, C and D. Segments of display scales are in fragments B, C, E and F. A schematic reconstruction is given in Fig. 2. It is not certain that every one of the remaining fragments (numbered 175) belong to the mechanism. The distinctive fragment A, which contains most of the gears, is approximately 180 3 150 mm in size. We have used three principal techniques to investigate the structure and inscriptions of the Antikythera Mechanism. (1) Three-dimensional X-ray microfocus computed tomography 24 (CT), developed by X-Tek Systems Ltd. The use of CT has been crucial in making the text legible just beneath the current surfaces. (2) Digital optical imaging to reveal faint surface detail using polynomial texture mapping (PTM) 25,26 , developed by Hewlett- Packard Inc. (3) Digitized high-quality conventional film photography. Vol 444 | 30 November 2006 | doi:10.1038/nature05357 587 Natu re Pu blishin g Gro u p 2 0 0 6 the key to understanding the function 6 of the upper back dial. The references to golden little sphere and little sphere probably refer to the front zodiac display for the Sun and Moonincluding phase for the latter. The text near the lower back dial includes Pharos and from south (about/around).Spain (ISPANIA) ten. These geograph- ical references, together with previous readings 1 of towards the east, west-north-west and west-south-west suggest an eclipse function for the dial, as solar eclipses occur only at limited geograph- ical sites, and winds were often recorded 1719 in antiquity with eclipse observations. Possibly this information was added to the mechanism during use. Turning to the dials themselves, the front dial displays the position of the Sun and Moon in the zodiac, and a corresponding calendar 1 of 365 days that could be adjusted for leap years. Previously 1 , it was suggested that the upper back dial might have five concentric rings with 47 divisions per turn, showing the 235 months of the 19-year Metonic cycle. A later proposal 5 augments this with the upper sub- sidiary dial showing the 76-year Callippic cycle. Our optical and X-ray microfocus computed tomography (CT) imaging confirms these proposals, with 34 scale markings discovered on the upper back dial. On the basis of a statistical analysis analogous to that described for gear tooth counts below, we confirm the 235 total divisions. We also find from the CT that the subsidiary dial is indeed divided into quadrants 1,6 , as required for a Callippic dial. In agreement with the back door inscription, we also substantiate the perceptive proposal 5,20 that the dial is in fact a spiral, made from semicircular arcs displaced Figure 2 | A schematic view of the mechanism to illustrate the position of major inscriptions and dials. The front dial has two concentric scales. The inner scale shows the Greek zodiac with 360 divisions. There are occasional Greek letters denoting references to the Parapegma inscription, and we add three further reference letters (Z, H, H) to Prices description 1 . The Parapegma is a star almanac showing rising and settings at dawn or evening of particular stars or constellations, which we will discuss elsewhere. Its form is consistent with a date of late second century BC. The outer (originally) movable scale is a calendar carrying the Egyptian names of the months with Greek letters. The Egyptian calendar of 365 days, with twelve 30-day months and 5 extra (epagomenai) days was in standard use in Greek astronomy. The effect of the extra quarter day in a year could be corrected by turning the scale one day every four yearsand a sequence of holes to take a locking pin is observed under the scale. We find that spacing of the holes is indeed what would be expected for a total of 365 days, with a possible range 363365. The position of the Sun and Moon would have been indicated by pointers across the dial scales, and a device 7 showing the phase of the Moon was probably carried round on the lunar pointer. It is not clear whether the Sun position pointer would have been separated from a date pointer, or whether any planetary positions might have been displayed. The spiral upper back dial displays the luni-solar Metonic sequence of 235 lunar months with a subsidiary dial showing the Callippic cycle, while the spiral lower back dial displays the 223-lunar-month Saros eclipse cycle with a subsidiary dial showing the Exeligmos cycle. Box 1 | Astronomical cycles known to the Babylonians The lunar (or synodic) month is the interval between the Moon being at the same phasefor example, full moon to full moon. The Metonic cycle results from the close equality of 19 years to 235 lunar months. It represents the return to the same phase of the Moon on the same date in the year. After the cycle, the Sun, Moon and Earth are back in nearly the same relative orientations. The Moon appears to return to the same point in the sky relative to the zodiac in a sidereal month, and in 19 years there are 235 1 19 5 254 sidereal months. The 76-year Callippic cycle is four Metonic cycles minus one dayand improves the accuracy of reconciling solar years with whole numbers of lunar months. The Saros is an eclipse repeat cycle. If either a solar or lunar eclipse occurs, a very similar eclipse will occur 223 lunar months later 23 .A record of past eclipses can thus be used to predict future occurrences. The cycle arises from the coincidence of three orbital periods of the Moon. These are: (1) same phase to same phase, 223 synodic monthseclipses will of course only occur at new or full Moon in the month; (2) the lunar crossing of the Earth Sun orbital plane, 242 draconitic monthseclipses can only occur near these points (nodes) of co-alignment; (3) similar Earth Moon distances which occur on the period from apogee to apogee of the Moons orbit, 239 anomalistic months. The distance will determine the magnitude of the eclipse, ensuring the similarity of eclipses at the period of the cycle. The Saros cycle is not an integer number of days (6,585M), causing the eclipses in successive cycles to be displaced by eight hours in time (and solar eclipses, only visible at limited geographical locations, to be displaced by 120u in longitude). True repeats come after 3 Saros cycles, the 54-year Exeligmos cycle, but not with identical solar eclipse paths. LETTERS NATURE | Vol 444 | 30 November 2006 588 Natu re Pu blishin g Gro u p 2 0 0 6 to two centres on the vertical midline. In the CT of fragment B we find a new feature that explains why the dial is a spiral: a pointer-follower device (Fig. 3) travelled around the spiral groove to indicate which month (across the five turns of the scale) should be read. From our CT data of the 48 scale divisions observed in fragments A, E and F, we establish 223 divisions in the four-turn 5,20 spiral on the lower back dial, the spiral starting at the bottom of the dial. This is the Saros eclipse cycle, whose number is on the back door inscription. The 54-year Exeligmos cycle of three Saros cycles is shown on the lower subsidiary dial. Between the scale divisions of the Saros dial we have identified 16 blocks of characters, or glyphs (see Supplementary Note 2 (glyphs and inscriptions)) at intervals of one, five and six months. These are eclipse predictions and contain either S for a lunar eclipse (from SELGNG, Moon) or G for a solar eclipse (from GLIOS, Sun) or both. A correlation analysis (analogous to DNA sequence matching) with historic eclipse data 21 (all modern eclipse data and predictions in our work are from this reference) indicates that over a period of 400 1 BC, the sequence of eclipses marked by the identified glyphs would be exactly matched by 121 possible start dates. The matching only occurs if the lunar month starts at first crescent, and confirms this choice of month start in the mechanism. The sequences of eclipses can then be used to predict the expected position of glyphs on the whole dial, as seen in Fig. 4. The dial starts and finishes with an eclipse. Although Ptolemy indicates that the Greeks recorded eclipses in the second century BC, the Babylonian Saros canon 1719 is the only known source of sufficient data to construct the dial. The functions of the mechanism are determined by the tooth counts of the gears. These are based mainly on the CT, using angular measurement from a nominal centre to the remains of tooth tips. In a few cases all teeth can be seen, but many gears are incomplete. Counts are established by fitting models with regularly spaced teeth and minimising the r.m.s. deviation from the measurementsvarying the centre in software (when unclear) to find the best-fit solution or solutions (see Supplementary Note 3 (gears)). We have adopted a systematic nomenclature of lower case letters for the axis of the gear, with numbering increasing with ordering from the front of the mech- anism. Hypothetical (lost) gears are denoted by italics. Several models have been proposed for the gear trains 1,2,46,8 . We agree with the assumption of four missing gears (n1, n2, p1, p2) to drive the Metonic and Callippic dials 4 . We propose a new reconstruc- tion for the other trains, which uses all extant gears (except the lone r1 0 1 2 3 4 5 cm Figure 4 | Reconstruction of the back dials. A composite of fragments A, B, E and F. The Metonic calendar is at top, with its subsidiary Callippic dial. The Saros eclipse cycle is below, with its subsidiary Exeligmos dial. The 16 observed eclipse glyphs are shown in turquoise on the Saros dial, with 35 hypothetical glyphs in violet. The hypothetical glyphs are based on the criterion that 99% of the 121 sequences exactly matching the observed glyphs have an eclipse at the month position. Both main dials would have a pointer-follower (see Fig. 3) to indicate the relevant lunar month on the spiral. The monthly divisions on the Metonic upper back dial are not simply scribed directly across all five turns, as might be expected for simplicity of construction. There are small misalignments, implying a systematic attempt at marking full (30-day) and hollow (29-day) months. The incomplete data do not allow good analysis, other than a hint of bimodality in the interval distribution. If the marking out of the scale were carried out using the mechanisms gearing, then this would greatly pre-date known dividing engines 27 by many centuries. Figure 3 | The pointer-follower lunar month indicator of the upper back dial. On the left, false-colour sections through CT images, analysed with VGStudio Max software by Volume Graphics GmbH. These show two views at right angles of the pointer-follower in the Metonic dial in fragment B. On the right, a computer reconstruction of the device from two different angles (with the Metonic scale omitted for clarity). The pin was constrained to follow the groove between the spiral scales (the scale is shown in Fig. 4), causing the device to slide along the month pointer to indicate which ring on the spiral scale specified the month. A similar pointer-follower would have been present on the lower back (Saros) dial. The Metonic dial would have required re- setting every 19 years, the Saros dial after 18 years. The groove-pin may have been held in place by the small pin through the front of the device, enabling its removal for re-setting. NATURE | Vol 444 | 30 November 2006 LETTERS 589 Natu re Pu blishin g Gro u p 2 0 0 6 from the separate fragment D). The proposed model is shown in Fig. 5. We require the assumption of only one further gear (m3), whose proposed shaft is clearly broken off in the CT. A detailed description is contained in Supplementary Note 3 (gears). Of particular note is the dual use of the large gear, e3, at the back of the mechanism, which has found no use in previous models. In our model, it is powered by m3 as part of a fixed-axis train that turns the Saros and Exeligmos dials for eclipse prediction, and also doubles as the epicyclic table for the gears k1, k2. These are part of epicyclic gearing that calculates the theory of the irregular motion of the moon, developed by Hipparchos some time between 146 and 128 BC (ref. 22)the first anomaly, caused by its elliptical orbit about the Earth. The period of this anomaly is the period from apogee to apogee (the anomalistic month). To realize this theory, the mean sidereal lunar motion is first calculated by gears on axes c, d and e and this is then fed into the epicyclic system. As explained in Fig. 6, a pin- and-slot device on the epicyclic gears k1 and k2, clearly seen in the CT, provides the variation. This was previously identified 4 , but rejected as a lunar mechanism. The remarkable purpose of mounting the pin-and-slot mechanism on the gear e3 is to change the period of variation from sidereal month (that is, the time taken for the Moon to orbit the Earth relative to the zodiac), which would occur if k1 and k2 were on fixed axes, to anomalistic monthby carrying the gears epicyclically at a rate that is the difference between the rates of the Front dials Lunar phase Lost epicyclic gearing Pin and slot Hipparchos lunar mechanism Possibly Hipparchos solar mechanism and planetary mechanisms Hipparchos sidereal month Year Back dials Luni-solar calendar Input Eclipse prediction Saros 4Metonic 5Callippic Exeligmos Zodiac Egyptian calendar Parapegma Figure 5 | New reconstruction of the gear trains. A schematic sectional diagram (not to scale) of the gearing, following the style of Price 1 and Wright 4 . The viewpoint is looking down from the top right of the mechanism, and is stretched in the direction of the main axes to show the structure. Features that are outlined or labelled in red are hypothetical. Gears are lettered with their shaft, and numbered with increasing distance from the front dial. The two-or-three digit number on the gear is its actual or assumed tooth count (see Supplementary Note 3 (gears)). Hypothetical gears n1, n2, p1, p2 have been proposed previously, the gear m3 on the broken-off shaft m is our addition. All gears, except the lone one in fragment D, are now accounted for in the mechanism. The function of the trains is outlined in the text. We find no evidence in the CT for an idler wheel carried on e3 and between e5 and k1 or between k2 and e6, as has been previously proposed 1,2,4 . The CT shows a pin through axis e between gears e1 and e2. We believe its purpose is to retain the square-bossed e1 on the shaft, but its passage right through the axis rules out previous reconstructions 1,2,4 where e1 and e2 were joined by an outer pipe rotating around the shaft e. Figure 6 | The Hipparchos lunar mechanism mounted on gear e3. The figure is based on a CT slice of part of fragment A, showing (top) shaft e and (bottom) shaft k. The complete geometry cannot be seen in a single CT slice. The two gears on the e axis (e5 and e6) are coaxial, while the two k gears rotate on slightly displaced axes. k1 has a pin on its face that engages with a radial slot in k2 (and this was previously reported 5 ). In the figure the pitch circles of e5 and k1 are shown in turquoise and those of e6 and k2 in pink. The gear e5 drives k1, which drives k2 via the pin-and-slot, introducing a quasi-sinusoidal variation in the motion, which is then transmitted to e6. Our estimate of the distance between the arbors on the k gears is about 1.1 mm, with a pin distance of 9.6 mm, giving an angular variation of 6.5u. According to Ptolemy 28 , Hipparchos made two estimates for a lunar anomaly parameter, based on eclipse data, which would require angular variations of 5.9u or 4.5u herealthough estimates of the anomaly from Babylonian astronomy were generally larger. The difference from our estimated value is probably not significant given the difficulty of precise measurement of the axes in the CT. The harmonic variation, together with the effect of carrying the gears on e3 (which rotates at the period of the Moons apogee around the Earth), would simulate the correct variation for the Moons mean (sidereal) rotation rate on the front dial. An (unexplained) regular pentagon is visible at the centre of gear e5. It is tempting to associate the conception of the mechanism with Hipparchos himself, but he was not the first to assume eccentric or epicyclic models. LETTERS NATURE | Vol 444 | 30 November 2006 590 Natu re Pu blishin g Gro u p 2 0 0 6 sidereal and anomalistic months, that is, at the rate of rotation of about 9 years of the Moons apogee. Gears with 53 teeth are awkward to divide. So it may seem sur- prising that the gearing includes two such gears (f1, l2), whose effects cancel in the train leading to the Saros dial. But the gearing has been specifically designed so that the epicyclic table e3 turns at the rate of rotation of the Moons apogeethe factor 53 being derived from the calculation of this rotation from the Metonic and Saros cycles, which are the bases for all the prime factors in the tooth counts of the gears. The establishment of the 53-tooth count of these gears is powerful confirmation of our proposed model of Hipparchos lunar theory. The output of this complex system is carried from e6 back through e3 and thence, via e1 and b3, to the zodiac scale on the front dial and the lunar phase 7 mechanism. Our CT confirms the complex structure of axis e that this model entails. The Antikythera Mechanism shows great economy and ingenuity of design. It stands as a witness to the extraordinary technological potential of Ancient Greece, apparently lost within the Roman Empire. Received 10 August; accepted 17 October 2006. 1. Price, D. de S. Gears from the Greeks: The Antikythera Mechanism A calendar computer from ca. 80 BC. Trans Am. Phil. Soc. New Ser. 64, 1 70 (1974); reprinted by Science History Publications, New York (1975). 2. Wright, M. T. Epicyclic gearing and the Antikythera Mechanism, Part I. Antiquar. Horol. 27, 270 279 (2003). 3. Wright, M. T., Bromley, A. G. & Magou, H. Simple X-ray tomography and the Antikythera Mechanism. PACT J. Eur. Study Group Phys. Chem. Biol. Math. Tech. Appl. Archaeol. 45, 531 543 (1995). 4. Wright, M. T. The Antikythera Mechanism: a New Gearing Scheme. Bull. Sci. Instrum. Soc. 85, 2 7 (2005). 5. Wright, M. T. Epicyclic gearing and the Antikythera Mechanism, Part II. Antiquar. Horol. 29, 51 63 (2005). 6. Wright, M. T. Counting months and years: The upper back dial of the Antikythera Mechanism. Bull. Sci. Instrum. Soc. 87, 8 13 (2005). 7. Wright, M. T. The Antikythera Mechanism and the early history of the moon- phase display. Antiquar. Horol. 29, 319 329 (2006). 8. Wright, M. T. in Proc. 2nd Int. Conf. on Ancient Greek Technology (ed. Tassios, Th.) 49 60 (Technical Chamber of Greece, Athens, 2006). 9. Wright, M. T. A planetarium display for the Antikythera Mechanism. Horol. J. 144(5), 169 173 (2002); erratum 144, 193 (2002). 10. North, J. D. The Fontana History of Astronomy and Cosmology (Fontana, London, 1994). 11. Bromley, A. G. The Antikythera Mechanism. Horol. J. 132, 412 415 (1990). 12. Bromley, A. G. in Bassernet Vol. 2, No. 3 (Basser Department of Computer Science, Univ. Sydney, June, 1993). 13. Freeth, T. The Antikythera Mechanism: 1. Challenging the classic research. Mediterr. Archaeol. Archaeom. 2, 21 35 (2002). 14. Edmunds, M. & Morgan, P. The Antikythera Mechanism: still a mystery of Greek astronomy? Astron. Geophys. 41, 6.10 6.17 (2000). 15. Freeth, T. The Antikythera Mechanism: 2. Is it Posidonius orrery? Mediterr. Archaeol. Archaeom. 2, 45 58 (2002). 16. Illsley, J. S. History and Archaeology of the ShipLecture Notes. http:// cma.soton.ac.uk/HistShip/shlect36.htm (1998). 17. Stephenson, F. R. Historical Eclipses and Earths Rotation (Cambridge Univ. Press, Cambridge, UK, 1997). 18. Steele, J. M. Observations and Predictions of Eclipse Times by Early Astronomers (Kluwer Academic, Dordrecht, 2000). 19. Steele, J. M. Eclipse prediction in Mesopotamia. Arch. Hist. Exact Sci. 54, 421 454 (2000). 20. Wright, M. T. The Scholar, the Mechanic and the Antikythera Mechanism. Bull. Sci. Instrum . Soc. 80, 4 11 (2003). 21. Espenak, F. NASA Eclipse Home Page. http://sunearth.gsfc.nasa.gov/eclipse/ eclipse.html (2005). 22. Jones, A. The adaptation of Babylonian methods in Greek numerical astronomy. Isis 82, 440 453 (1991). 23. Britton, J. P. in Die Rolle der Astronomie in den Kulturen Mesopotamiens (ed. Galter, H. D.) 61 76 (rm-Druck & Vergansgesellschaft, Graz, 1993). 24. X-Tek Systems Ltd. 3-D computed tomography. http://www.xtek.co.uk/ct/ (2006). 25. Malzbender, T. & Gelb, D. Polynomial texture mapping. http:// www.hpl.hp.com/research/ptm/ (2006). 26. Brooks, M. Tricks of the light. New Sci. 170, 38 49 (2001). 27. Chapman, A. Dividing the Circle (Wiley, Chichester, 1995). 28. Toomer, G. J. Ptolemys Almagest (transl. Toomer, G. J.) (Princeton Univ. Press, Princeton, New Jersey, 1998). Supplementary Information is linked to the online version of the paper at www.nature.com/nature. Acknowledgements This work was financed by the Leverhulme Trust, the Walter Hudson Bequest, the University of Athens Research Committee and the Cultural Foundation of the National Bank of Greece. For essential support we thank the Ministry of Culture, Greece (P. Tatoulis), and the National Archaeological Museum of Athens (N. Kalts as). We acknowledge help and advice from J. Ambers, J. Austin, G. Dermody, H. Forsyth, I. Freestone, P. Haycock, V. Horie, A. Jones, M. Jones, P. Kipouros, H. Kritzas, J. Lossl, G. Makris, A. Ray, C. Reinhart, A. Valassopoulos, R. Westgate, T. Whiteside, S. Wright and C. Xenikakis. Author Contributions T.F. carried out most of the CT analysis of structure and its interpretation. Y.B., A.T. and X.M. read, transcribed and translated the inscriptions. H.M and M.Z. catalogued the fragments, provided guidance on X-ray examination, and measured the fragments with J.H.S. R.H. led the team (D.B., A.R., M.A., A.C. and P.H.) that built and operated the Bladerunner CT machine, and provided CT reconstructions and advice. T.M., D.G. and W.A. built, operated and provided software for the PTM. M.G.E. was academic lead, and undertook the statistical analysis. T.F. and Y.B. organised the logistics of the experimental work, with inter-agency liaison by X.M. and J.H.S. The manuscript was written by T.F. and M.G.E. including material from Y.B., A.T., X.M., J.H.S., H.M. and M.Z. T.F. designed the illustrations. Author Information Reprints and permissions information is available at www.nature.com/reprints. The authors declare no competing financial interests. Correspondence and requests for materials should be addressed to M.G.E. (mge@astro.cf.ac.uk). NATURE | Vol 444 | 30 November 2006 LETTERS 591 Natu re Pu blishin g Gro u p 2 0 0 6 View publication statsView publication stats ",
        "_version_": 1718536530718359552
      },
      {
        "story_id": 20755974,
        "story_author": "nnnmnten",
        "story_descendants": 86,
        "story_score": 141,
        "story_time": "2019-08-21T10:25:24Z",
        "story_title": "AdoptOpenJDK: Open-source, prebuilt OpenJDK binaries",
        "search": [
          "AdoptOpenJDK: Open-source, prebuilt OpenJDK binaries",
          "https://adoptopenjdk.net/",
          "HotSpot is the VM from the OpenJDK community. It is the most widely used VM today and is used in Oracles JDK. It is suitable for all workloads. For more details see OpenJDK HotSpot. Eclipse OpenJ9 is the VM from the Eclipse community. It is an enterprise-grade VM designed for low memory footprint and fast start-up and is used in IBMs JDK. It is suitable for running all workloads. For more details see Eclipse OpenJ9. LTS (Long Term Support). These versions have a longer support timeframe. Suitable for enterprise customers. See Support for more information. "
        ],
        "story_type": "Normal",
        "url_raw": "https://adoptopenjdk.net/",
        "url_text": "HotSpot is the VM from the OpenJDK community. It is the most widely used VM today and is used in Oracles JDK. It is suitable for all workloads. For more details see OpenJDK HotSpot. Eclipse OpenJ9 is the VM from the Eclipse community. It is an enterprise-grade VM designed for low memory footprint and fast start-up and is used in IBMs JDK. It is suitable for running all workloads. For more details see Eclipse OpenJ9. LTS (Long Term Support). These versions have a longer support timeframe. Suitable for enterprise customers. See Support for more information. ",
        "comments.comment_id": [20757799, 20758542],
        "comments.comment_author": ["hs86", "latchkey"],
        "comments.comment_descendants": [1, 3],
        "comments.comment_time": [
          "2019-08-21T14:55:13Z",
          "2019-08-21T16:02:38Z"
        ],
        "comments.comment_text": [
          "On macOS and Windows their various builds are also available over the Homebrew and Scoop package managers:<p><a href=\"https://github.com/AdoptOpenJDK/homebrew-openjdk\" rel=\"nofollow\">https://github.com/AdoptOpenJDK/homebrew-openjdk</a><p><a href=\"https://github.com/lukesampson/scoop/wiki/Java\" rel=\"nofollow\">https://github.com/lukesampson/scoop/wiki/Java</a>",
          "You don't need extra projects to manage this stuff anymore.<p>There is a great answer here... <a href=\"https://stackoverflow.com/questions/52524112/how-do-i-install-java-on-mac-osx-allowing-version-switching\" rel=\"nofollow\">https://stackoverflow.com/questions/52524112/how-do-i-instal...</a><p><pre><code>  brew install java (12)\n  brew install java11\n</code></pre>\nAnd you can simplify things...<p>In your .bashrc:<p><pre><code>  export JDK_HOME=`/usr/libexec/java_home -v 12` # v9+ change to the version you installed\n  export JAVA_PATH=$JDK_HOME\n  export JAVA_HOME=$JDK_HOME\n  export PATH=\".\"\n  export PATH=\"${PATH}:${JAVA_HOME}/bin\"</code></pre>"
        ],
        "id": "ac6abdfa-1a7c-4af2-b01b-ed25f512ff44",
        "_version_": 1718536513838383104
      },
      {
        "story_id": 21907168,
        "story_author": "another",
        "story_descendants": 18,
        "story_score": 86,
        "story_time": "2019-12-29T17:36:03Z",
        "story_title": "DIY ‘Meta Clock’ with 24 Analog Clocks",
        "search": [
          "DIY ‘Meta Clock’ with 24 Analog Clocks",
          "https://mcuoneclipse.com/2019/12/29/diy-meta-clock-with-24-analog-clocks/",
          "MCU on Eclipse Everything on Eclipse, Microcontrollers and Software Main menu Home Eclipse PEx Components FreeRTOS USB FatFs I2C SPI CDE Compendium Pictures Q&A Books! Bucket List About Requests Mark Dunnett Guest Blog Post navigation Previous Next Human since 1982 claims Human since 1982 have the copyright to works displaying digital time using a grid arrangement of analog clocks Im not a lawyer, but without obligations (imho) I have removed the content. You can read more of the details here: Copyright Law for Makers and Educators Thanks for understanding, Erich "
        ],
        "story_type": "Normal",
        "url_raw": "https://mcuoneclipse.com/2019/12/29/diy-meta-clock-with-24-analog-clocks/",
        "url_text": "MCU on Eclipse Everything on Eclipse, Microcontrollers and Software Main menu Home Eclipse PEx Components FreeRTOS USB FatFs I2C SPI CDE Compendium Pictures Q&A Books! Bucket List About Requests Mark Dunnett Guest Blog Post navigation Previous Next Human since 1982 claims Human since 1982 have the copyright to works displaying digital time using a grid arrangement of analog clocks Im not a lawyer, but without obligations (imho) I have removed the content. You can read more of the details here: Copyright Law for Makers and Educators Thanks for understanding, Erich ",
        "comments.comment_id": [21909389, 21913416],
        "comments.comment_author": ["sunsetMurk", "reaperducer"],
        "comments.comment_descendants": [1, 0],
        "comments.comment_time": [
          "2019-12-29T23:28:24Z",
          "2019-12-30T14:11:45Z"
        ],
        "comments.comment_text": [
          "Dang. I want one of these on my wall!<p>But, I don't have the $$$ for the real ones [0], nor the knowhow to build one using the info in this post.<p>Maybe I'll try to get some time together to learn more about PCB design/hardware... or even try and turn this into a side project to try an open-source collab to make it a more complete kit/tutorial.<p>0 - <a href=\"https://clockclock.com/\" rel=\"nofollow\">https://clockclock.com/</a>",
          "There was an iOS version of this from a Swedish company called Chapel. It appears to be officially licensed from Humans Since 1982.<p>Unfortunately, the app company seems to be gone, so the app is no longer on the App Store (I still have it installed on my devices, though.)<p>But the originators are still around: <a href=\"https://www.humanssince1982.com/\" rel=\"nofollow\">https://www.humanssince1982.com/</a>"
        ],
        "id": "ec3d6894-4ae6-4666-af5a-778986f1a893",
        "_version_": 1718536556371771392
      },
      {
        "story_id": 21207425,
        "story_author": "mooreds",
        "story_descendants": 22,
        "story_score": 125,
        "story_time": "2019-10-09T20:09:38Z",
        "story_title": "Alloy is a language for describing structures and a tool for exploring them",
        "search": [
          "Alloy is a language for describing structures and a tool for exploring them",
          "https://github.com/AlloyTools/org.alloytools.alloy",
          "Alloy Alloy 6 is a self-contained executable, which includes an extended version of the Kodkod model finder and a variety of SAT solvers, as well as the standard Alloy library and a collection of tutorial examples. The same jar file can be incorporated into other applications to use Alloy as an API, and includes the source code. See the release notes for details of new features. Alloy 6 is a major new release More documentation can be found at: http://alloytools.org/documentation.html. Requirements Alloy runs on all operating systems with a recent JVM (Java 6 or later). It is made available as a runnable jar file with both a cross-platform SAT solver (Sat4j and more efficient native SAT solvers (minisat, lingeling/plingeling, glucose). Note however that starting with macOS High Sierra, it is necessary to install a dedicated JVM to run Alloy on macOS. A .pkg file is provided for that purpose. TL;DR Checkout the project and type ./gradlew build. You find the executable JAR in org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar after the build has finished. $ java version # requires 1.8 (and NOT 1.9, gradle does not run on 1.9) java version \"1.8.0_144\" Java(TM) SE Runtime Environment (build 1.8.0_144-b01) Java HotSpot(TM) 64-Bit Server VM (build 25.144-b01, mixed model $ git clone --recursive https://github.com/AlloyTools/org.alloytools.alloy.git $ cd org.alloytools.alloy $ ./gradlew build $ java -jar org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar # opens GUI Note: if you are behind a proxy, the call to gradlew is likely to fail, unless you pass it further options about the http and https proxies (and possibly your login and password on this proxy). There are several ways to pass these options, a simple one is to type (replace the XXXXX's by the adequate settings): $ ./gradlew -Dhttps.proxyHost=XXXXX -Dhttp.proxyHost=XXXXX -Dhttp.proxyPort=XXXXX \\ -Dhttps.proxyPort=XXXXX -Dhttp.proxyUser=XXXXX -Dhttp.proxyPassword=XXXXX \\ -Dhttps.proxyUser=XXXXX -Dhttps.proxyPassword=XXXXX \\ build Building Alloy The Alloy build is using a bnd workspace setup using a maven layout. This means it can be build with Gradle and the Eclipse IDE for interactive development. Projects are setup to continuously deliver the executable. Projects The workspace is divided into a number of projects: cnf Setup directory. Dependencies are specified in [cnf/central.xml] using the maven POM layout org.alloytools.alloy.application Main application code includes the parser, ast, visualiser, and application code org.alloytools.alloy.dist Project to create the distribution executable JAR org.alloytools.alloy.extra Models and examples org.alloytools.pardinus A Kodkod extension without native code org.alloytools.kodkod.nativesat The native code libraries for Kodkod Relevant Project files This workspace uses bnd. This means that the following have special meaning: cnf/build.xml Settings shared between projects ./bnd.bnd Settings for a project. This file will drag in code in a JAR. cnf/central.xml Dependencies from maven central Eclipse The workspace is setup for interactive development in Eclipse with the Bndtools plugin. Download Eclipse and install it. You can then Import existing projects from the Git workspace. You should be asked to install Bndtools from the market place. You can also install Bndtools directly from the Eclipse Market place (see Help/Marketplace and search for Bndtools). Bndtools will continuously create the final executable. The projects are setup to automatically update when a downstream project changes. IntelliJ IDEA (Ultimate Edition only) Ensure you have the Osmorc plugin is enabled, as this plugin is needed for Bndtools support. It should be enabled by default. Choose \"Import Project\" Select the org.alloytools.alloy directory. Choose \"Import project from external model: Bnd/Bndtools\" and click \"Next\" For \"Select Bnd/Bndtools project to import\", all projects should be checked by default, click \"Next\" For project SDK, Choose \"1.8\", Click Finish Note: do not link the Gradle project, as this will prevent you from running Alloy within IDEA. To run the Alloy GUI within IDEA, navigate to org.alloytools.alloy.application/src/main/java/edu/mit/csail/sdg/alloy4whole/SimpleGUI and run the SimpleGUI class. Gradle In the root of this workspace type ./gradlew. This is a script that will download the correct version of gradle and run the build scripts. For settings look at [gradle.properties] and [settings.gradle]. Continuous Integration The workspace is setup to build after every commit using Travis. It releases snapshots to https://oss.sonatype.org/content/repositories/snapshots/org/alloytools/ for every CI build on Travis. Building the DMG file for OSX systems Currently only the executable jar in org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar is build. In the org.alloytools.alloy.dist project, run ../gradlew macos. This will leave the PKG file in target/bundle. CONTRIBUTIONS Please read the CONTRIBUTING to understand how you can contribute. "
        ],
        "story_type": "Normal",
        "url_raw": "https://github.com/AlloyTools/org.alloytools.alloy",
        "comments.comment_id": [21226326, 21226708],
        "comments.comment_author": ["hwayne", "infogulch"],
        "comments.comment_descendants": [1, 3],
        "comments.comment_time": [
          "2019-10-11T17:11:30Z",
          "2019-10-11T17:51:46Z"
        ],
        "comments.comment_text": [
          "There was a fantastic talk at strangeloop this year on Alloy: <a href=\"https://www.youtube.com/watch?v=FvNRlE4E9QQ\" rel=\"nofollow\">https://www.youtube.com/watch?v=FvNRlE4E9QQ</a>. The speaker used it to find a serious security bug in their live code and a feature interaction bug in their UI that had meant they had been writing broken code for the past _year_.<p>(full disclosure I'm referenced towards the end)",
          "Last week Microsoft Research posted an interesting talk by Kevin Buzzard [1] from Imperial College London about how he wants to formalize all mathematics with theorem provers.  He's currently using LEAN [2].  Half of the talk is a discussion of the challenges he's faced convincing other mathematicians that this is valuable, and the other half is about his success using LEAN as a tool to teach undergraduates about formal proofs in general.<p>I think Alloy was mentioned at the end, but not really compared to LEAN.<p>[1]: <a href=\"https://youtu.be/Dp-mQ3HxgDE\" rel=\"nofollow\">https://youtu.be/Dp-mQ3HxgDE</a><p>[2]: <a href=\"https://leanprover.github.io/\" rel=\"nofollow\">https://leanprover.github.io/</a>"
        ],
        "id": "b7d04fa5-be10-45f8-abd6-17594fb2efe0",
        "url_text": "Alloy Alloy 6 is a self-contained executable, which includes an extended version of the Kodkod model finder and a variety of SAT solvers, as well as the standard Alloy library and a collection of tutorial examples. The same jar file can be incorporated into other applications to use Alloy as an API, and includes the source code. See the release notes for details of new features. Alloy 6 is a major new release More documentation can be found at: http://alloytools.org/documentation.html. Requirements Alloy runs on all operating systems with a recent JVM (Java 6 or later). It is made available as a runnable jar file with both a cross-platform SAT solver (Sat4j and more efficient native SAT solvers (minisat, lingeling/plingeling, glucose). Note however that starting with macOS High Sierra, it is necessary to install a dedicated JVM to run Alloy on macOS. A .pkg file is provided for that purpose. TL;DR Checkout the project and type ./gradlew build. You find the executable JAR in org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar after the build has finished. $ java version # requires 1.8 (and NOT 1.9, gradle does not run on 1.9) java version \"1.8.0_144\" Java(TM) SE Runtime Environment (build 1.8.0_144-b01) Java HotSpot(TM) 64-Bit Server VM (build 25.144-b01, mixed model $ git clone --recursive https://github.com/AlloyTools/org.alloytools.alloy.git $ cd org.alloytools.alloy $ ./gradlew build $ java -jar org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar # opens GUI Note: if you are behind a proxy, the call to gradlew is likely to fail, unless you pass it further options about the http and https proxies (and possibly your login and password on this proxy). There are several ways to pass these options, a simple one is to type (replace the XXXXX's by the adequate settings): $ ./gradlew -Dhttps.proxyHost=XXXXX -Dhttp.proxyHost=XXXXX -Dhttp.proxyPort=XXXXX \\ -Dhttps.proxyPort=XXXXX -Dhttp.proxyUser=XXXXX -Dhttp.proxyPassword=XXXXX \\ -Dhttps.proxyUser=XXXXX -Dhttps.proxyPassword=XXXXX \\ build Building Alloy The Alloy build is using a bnd workspace setup using a maven layout. This means it can be build with Gradle and the Eclipse IDE for interactive development. Projects are setup to continuously deliver the executable. Projects The workspace is divided into a number of projects: cnf Setup directory. Dependencies are specified in [cnf/central.xml] using the maven POM layout org.alloytools.alloy.application Main application code includes the parser, ast, visualiser, and application code org.alloytools.alloy.dist Project to create the distribution executable JAR org.alloytools.alloy.extra Models and examples org.alloytools.pardinus A Kodkod extension without native code org.alloytools.kodkod.nativesat The native code libraries for Kodkod Relevant Project files This workspace uses bnd. This means that the following have special meaning: cnf/build.xml Settings shared between projects ./bnd.bnd Settings for a project. This file will drag in code in a JAR. cnf/central.xml Dependencies from maven central Eclipse The workspace is setup for interactive development in Eclipse with the Bndtools plugin. Download Eclipse and install it. You can then Import existing projects from the Git workspace. You should be asked to install Bndtools from the market place. You can also install Bndtools directly from the Eclipse Market place (see Help/Marketplace and search for Bndtools). Bndtools will continuously create the final executable. The projects are setup to automatically update when a downstream project changes. IntelliJ IDEA (Ultimate Edition only) Ensure you have the Osmorc plugin is enabled, as this plugin is needed for Bndtools support. It should be enabled by default. Choose \"Import Project\" Select the org.alloytools.alloy directory. Choose \"Import project from external model: Bnd/Bndtools\" and click \"Next\" For \"Select Bnd/Bndtools project to import\", all projects should be checked by default, click \"Next\" For project SDK, Choose \"1.8\", Click Finish Note: do not link the Gradle project, as this will prevent you from running Alloy within IDEA. To run the Alloy GUI within IDEA, navigate to org.alloytools.alloy.application/src/main/java/edu/mit/csail/sdg/alloy4whole/SimpleGUI and run the SimpleGUI class. Gradle In the root of this workspace type ./gradlew. This is a script that will download the correct version of gradle and run the build scripts. For settings look at [gradle.properties] and [settings.gradle]. Continuous Integration The workspace is setup to build after every commit using Travis. It releases snapshots to https://oss.sonatype.org/content/repositories/snapshots/org/alloytools/ for every CI build on Travis. Building the DMG file for OSX systems Currently only the executable jar in org.alloytools.alloy.dist/target/org.alloytools.alloy.dist.jar is build. In the org.alloytools.alloy.dist project, run ../gradlew macos. This will leave the PKG file in target/bundle. CONTRIBUTIONS Please read the CONTRIBUTING to understand how you can contribute. ",
        "_version_": 1718536531205947392
      }
    ]
  }
}
